{
    "funny": {
        "popularity": 26440265, 
        "rules": [
            "Humor is subjective, but all posts must at least make an attempt at humor. As the minimum age for Reddit access is [13 years old](https://www.reddit.com/r/help/comments/7h5xr7/is_there_a_age_limit_for_reddit/dqodxmb), posts which are intentionally disruptive, inane, or nonsensical will be removed.", 
            "If your submission begins with \"When you…\" or \"When they…\" or anything of a similar nature, it is not allowed here. Submissions depicting or containing intentionally emulated behaviors ([memes](https://www.reddit.com/r/funny/wiki/rules#wiki_what_is_a_meme.3F)) are also not allowed, including memetic image macros, \"challenges,\" or elements thereof. Non-memetic image macros are allowed.", 
            "Reposts will be removed at the moderators’ discretion. Serial reposters will be banned. Please use [KarmaDecay](http://www.karmadecay.com) to determine if something has been submitted here before.", 
            "No identifying information, including anything hosted on platforms making that information public. Posts encouraging the harassment of any individual, group, community, or subreddit will be removed, and the submitting user may be banned. If necessary, a report will be made to the site administration. In accordance with [Reddit's policies](https://www.reddithelp.com/en/categories/rules-reporting/account-and-community-restrictions/do-not-threaten-harass-or-bully), there is zero tolerance for this.", 
            "Anything involving politics or a political figure (regardless of context) will be removed. \n\nTry /r/politicalhumor instead.", 
            "No asking for upvotes (in any form), no “Cake Day” posts, and no posts to communicate with another Redditor. Posts with titles such as \"I got banned from \\/r/\\_\\_\\_\" or \"This got removed from \\/r/\\_\\_\\_\" are not allowed. Emoji-based titles, memetic titles, and titles meant to circumvent any other rules are also forbidden.", 
            "Try /r/NSFWfunny. All other NSFW content must be tagged as such.", 
            "If you are not the author of the comic in question, you may only submit links to the page where it is hosted. Webcomic authors may [request verification](https://www.reddit.com/r/funny/wiki/comicauthor) from the moderators, after which they may rehost their own work. ", 
            "Submissions in which the humor can be conveyed via text alone are not allowed. This includes pictures of text with irrelevant images that don't add context, and transcriptions of standup comedy (as with /r/standupshots). Make a self post instead. [Example](http://i.imgur.com/2cPuY8C.jpg)", 
            "Social media content of any kind is not allowed. This includes anything from Reddit, Twitter, Tumblr, Facebook, YouTube, or any other form of \"comments section\" on the Internet, as well as [images accompanied by text from those platforms](https://i.imgur.com/LJ5ZeU6.png). Images with SnapChat text added are allowed, as long as all UI elements have been removed.\n\nPlease view [our wiki](https://www.reddit.com/r/funny/wiki/rules) for suggestions of where these submissions can be offered."
        ]
    }, 
    "AskReddit": {
        "popularity": 24515284, 
        "rules": [
            "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)", 
            "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use personal pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)", 
            "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)", 
            "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)", 
            "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)", 
            "Questions seeking professional advice are inappropriate for this subreddit and will be removed. This includes but is not limited to medical, legal, mental health and financial advice. If you think that you need professional support, please contact a professional in your area as the qualifications of anyone giving advice on reddit can not be verified.\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)", 
            "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)", 
            "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n* Do not spam or make attempts to farm karma\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)", 
            "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)", 
            "Comments made in posts tagged [serious] may not contain jokes or off topic remarks\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_--.5Bserious.5D_tags--)"
        ]
    }, 
    "gaming": {
        "popularity": 23651282, 
        "rules": [
            "\"Related\" means that posts must contain gaming-related content in the link's content, or in the post's body in the case of a self-post, not just a \"forced\" connection via the title or a caption added to the content.\n\nNote that we do not allow non-gaming meme templates as submissions.\n\nFor more info, [visit our rules page](https://www.reddit.com/r/gaming/wiki/index#wiki_rule_1.3A_gaming-related)", 
            "If you have a response to an existing post, reply to it in the comments section instead of making your own post about it.\n\nIf you have something to say about a topic currently on the front page, please say it as a comment in the already front page post.", 
            "Enabling piracy via reddit, be it links to torrent sites, direct downloads, smoke signals that give instructions on how to pirate something, etc are not okay here. Don't do it. Whether or not if you agree with the practice, copyright infringement will not be tolerated. There are plenty of other sites on the internet where you can do it; if you must, go wild there, but not here, please.\n\n**Enabling or attempting to enable piracy will result in a permanent ban.**", 
            "Spoilers must be posted using the following formatting:\n\n`[X Kills Y](/spoiler)`  \nResult: [X Kills Y](/spoiler).  \nTo mark a spoiler as relevant to a specific game/topic, use the alternate formatting:  \n`[Player 1 wins](/spoiler \"Pong\")`  \nResult:  \n[Player 1 wins](/spoiler \"Pong\")  \n\nSpoilers are NOT allowed in submission titles.\n\nNSFW content must be marked / flaired as such.", 
            "No product requests, giveaways, trades, contests, or items for sale.\n\nPut simply, you can't ask for free stuff here, and you can't host giveaways here either. \n\nTrade posts and contests hosted on the subreddit will be removed.\n\nThe subreddit is also not the place to put your items up for sale.", 
            "Make the original source of the content your submission, and do not use URL shorteners.\n\nIf a mirror is necessary, please provide one in comments. No hotlinking or rehosting someone else's work (unless they specifically allow it in their terms of use or request it).", 
            "Don't spam.  No referral/affiliate links.\n\nWe understand you have a youtube and/or streaming channel. Posts to your personal videos or channels may be removed even if you're not monetizing them, just getting started or just thought it was cool. Generally speaking, due to the nature of their timeliness most streams may not be well-suited for this subreddit.\n\nAll users must abide by reddit's general [rules of promotion](http://www.reddit.com/wiki/selfpromotion), which allow 10% max on submissions.", 
            "Submissions about new projects or major updates to existing ones are allowed. If you have or know of a project you're excited about, that's great! We want you to share it with the community, but we don't need nag posts every day directing people back to the crowd funding page. A new post for a project is allowed if it's been updated in a significant way.", 
            "Posts and comments, whether in jest or with malice, that contain racist, sexist, homophobic, etc. content, or threats will be removed, regardless of popularity or relevance.\n\nEspecially egregious violations or repeat offenses may result in accounts banned from /r/gaming.", 
            "**Post rules.**\n\nMust be from someone currently or previously employed in the gaming industry.\n\nMust be about something already done.\n\nNo asking for money or crowd funding.\n\nPublic proof is required.\n\nNo giveaways or contests.\n\nNo request posts.\n\n**Comment rules**.\n\nDo not ask for free stuff or personal favors.\n\nDo not spam the same comment or question over and over again.\n\nNo vote manipulation.\n\nRule 10\n\n[For more info on these rules, **click here.**](https://www.reddit.com/r/gaming/wiki/ama)"
        ]
    }, 
    "pics": {
        "popularity": 22834095, 
        "rules": [
            "(1A) No screenshots or pictures of just a screen.\n\n(1B) No pictures with added/superimposed digital text, emojis, or \"MS Paint\"-like scribbles. Exceptions to this rule include watermarks serving to credit the original author, and the blurring-out or boxing-out of personal information. Photoshopped or otherwise manipulated images are allowed.", 
            "No gore or pornography. Artistic nudity is allowed. NSFW comments must be tagged. Posting gratuitous materials may result in an immediate and permanent ban.", 
            "No personal information in posts or comments. No direct links to any social media. No missing/found posts for people or property. A license plate is not personal information.\n\nStalking, harassment, witch-hunting, or doxxing will not be tolerated, and will result in a ban.\n\nNo subreddit-related meta-drama or witch-hunts.", 
            "Titles must follow all [title guidelines](https://www.reddit.com/r/pics/wiki/titles).", 
            "Submissions must link directly to a specific image file, or to a website with very few advertisements. We do not allow blog-hosting of images (\"blogspam\"), but links to albums on image-hosting websites are acceptable. Advertisements in album titles or descriptions are not allowed.", 
            "No posts containing animated images or links to video sites. This applies to all file types. Animated images in the comments are fine.", 
            "We enforce a standard of common decency and civility. Please be respectful to others. Personal attacks, bigotry, fighting words, incitements to harass, comments which demean or insult specific users (or groups of users), and other such inappropriate behavior or content is not allowed. Regular or egregious violations will result in a ban.", 
            "No posts featuring before-and-after depictions of personal health progress or achievement.", 
            "Serial reposters may be filtered.\n\nFalse claims of ownership (FCoO) and/or flooding (more than four posts in twenty-four hours) will result in a ban.", 
            "This applies only to posts that are currently on the front page of /r/Pics.", 
            "Content creators are only allowed one link per post. Anything more may result in temporary or permanent bans. Accounts that exist solely to advertise or promote will be banned."
        ]
    }, 
    "science": {
        "popularity": 22391818, 
        "rules": [
            "Submissions must directly link to recently published peer-reviewed research or media summary. Review articles are prohibited unless they contain new results.\n\n[View all submission rules](https://www.reddit.com/r/science/wiki/rules#wiki_submission_rules)", 
            "Articles that obtain their information second-hand from other articles are not acceptable for submission. Websites that re-host press releases are prohibited.\n\nAll peer-reviewed articles must contain new research, data analysis, or meta-analysis. Review articles are prohibited unless they contain new results.\n\nReposting of existing, popular submissions is prohibited.\n\n[View all submission rules](https://www.reddit.com/r/science/wiki/rules#wiki_submission_rules)", 
            "The title and content of submissions should not be editorialized, sensationalized, or biased. All titles must adhere to our [headline rules](https://www.reddit.com/r/science/wiki/clickbait).\n\n[View all submission rules](https://www.reddit.com/r/science/wiki/rules#wiki_submission_rules)", 
            "All submissions must have been published within the past six months. This time requirement refers to the publication date of the research, not the article or web page. Ambiguous publication dates are determined by the first available date, which is typically the 'Published Online' or 'Pre-Print' date.\n\n[View all submission rules](https://www.reddit.com/r/science/wiki/rules#wiki_submission_rules)", 
            "Comments must be on topic and not a meme or joke. Comments should constructively contribute to the discussion or be an attempt to learn more.\n\n[View all comment rules](https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules)", 
            "Comments must be on topic and not a meme or joke. Comments should constructively contribute to the discussion or be an attempt to learn more.\n\n[View all comment rules](https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules)", 
            "Abusive or offensive comments will be subject to removal and repeat or malicious offenders will be banned. Bots and novelty accounts are prohibited and will be banned immediately.\n\n[View all comment rules](https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules)", 
            "Comments that only rely on a user's non-professional anecdotal evidence to confirm or refute a study will be removed (e.g. \"I do that but that result doesn't happen to me\"). Comments should be limited in personal details and scientific in nature. Including references to peer-reviewed research to support your claims is highly encouraged.\n\n[View all comment rules](https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules)", 
            "Comments that dispute well-established scientific concepts (e.g. gravity, vaccination, anthropogenic climate change, etc.) must be supported with appropriate peer-reviewed evidence. Links to personal blogs or 'skeptic' websites are not valid forms of evidence. Comments that are overtly fringe and/or unsubstantiated will be removed.\n\n[View all comment rules](https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules)", 
            "Offering or seeking medical advice is strictly prohibited and offending comments will be removed. Discussions regarding the advantages and/or disadvantages of certain treatments, diets, or supplements are allowed as long as relevant and reputable evidence is provided.\n\n[View all comment rules](https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules)"
        ]
    }, 
    "worldnews": {
        "popularity": 22152622, 
        "rules": [
            "Articles about events within the US or related to the US internal political process with no involvement of foreign officials or international organizations and no effect on people outside the US are not allowed here. The large subreddits for these topics are /r/news and /r/politics.", 
            "Do not add opinion/commentary to the submission title. Don't add something that isn't covered by the article, and don't misrepresent the article. Adding a sentence from within the article that is more representative of the content is generally OK.\n\nAn article's title must not be misleading.  It may be removed if the title states a source's opinion as fact, or misrepresents the facts in the article or multiple other sources. \n\nAll caps words are not allowed, except for acronyms of course.", 
            "Feature stories are journalistic reports providing more descriptive background information than a straight news report will contain. Dictionary.com: \"a newspaper or magazine article or report of a person, event, an aspect of a major event, or the like, often having a personal slant and written in an individual style.\"", 
            "/r/worldnews is for news, rather than analysis. There are several subreddits listed at the top of the page that are good for this. If the writer injects his/her opinion in the article or tries to draw any conclusion about a set of events, then it is no longer straight news and is not permitted in /r/worldnews.", 
            "This includes articles that are auto-translated.", 
            "If images, videos or audio files are part of an article that's fine, but the accompanying article must have some value of its own. Merely providing image captions or video descriptions isn't sufficient.", 
            "Hate speech directed towards an entire group of people who share a race, gender, sexual orientation, ethnicity, religion, nationality, social status or disability is not allowed.  This also applies to user names.", 
            "You may criticize a user's comment but not their person. Calling people names shuts down discussion. Accusing another user of being a \"shill\" is considered a personal attack. Stick to the issues and remain civil.", 
            "Memes may show up in image or in text form. Both are not allowed.\n\nBesides, porn or shock images unrelated to the story discussed will always be removed and posting them is an easy way to get banned.", 
            "Old News is any news older than one week."
        ]
    }, 
    "aww": {
        "popularity": 21958713, 
        "rules": [
            "No \"sad\" content, such as pics of animals that have passed away (try /r/petloss),  before-and-after adoption pics (try /r/BeforeNAfterAdoption), or sob stories (e.g. found him in a dumpster, try /r/BeforeNAfterAdoption).", 
            "No comics, captioned pictures/videos (try /r/lolcats or /r/animaltextgifs), or photos of just text.", 
            "No post titles asking for upvotes or approval, such as \"any love for...\", \"what does /r/aww think of...\", or \"this didn't get much love on...\", or \"karma machine\".", 
            "No slurs or harassing comments.", 
            "No posts with links to sites not on the approved list.", 
            "This includes not only inappropriate images but also inappropriate text, innuendo, or inappropriate jokes in comments. ", 
            "No asking for donations, sponsorship or adoptions (try /r/care or /r/assistance).", 
            "No bots or bot-like behavior.", 
            "No false claims of content ownership.", 
            "No links to social media content, whether in comments, submissions, image/video descriptions (including imgur gallery descriptions for direct links), or as superimposed text in an image. Handles are okay in comments as long as they're not links."
        ]
    }, 
    "todayilearned": {
        "popularity": 21515825, 
        "rules": [
            "Please link directly to a reliable source that supports every claim in your post title. Images alone do not count as valid references. Videos are fine so long as they come from reputable sources (e.g. BBC, Discovery, etc).", 
            "(e.g \"TIL xyz is a great movie\")", 
            "Any sources (blog, article, press release, video, etc.) more recent than two months are not allowed.", 
            "No submissions regarding or related to the following: recent politics, politicians, police misconduct, race/religion/gender. See wiki for more detailed explanation", 
            "Posts that omit essential information, or present unrelated facts in a way that suggest a connection will be removed.", 
            "a. Titles must begin with \"TIL\" or \"Today I Learned\"\nb. Make them descriptive, concise and specific (e.g. not \"TIL something interesting about bacon\").\nc. Titles must be able to stand on their own without requiring readers to click on a link.\nd. \"TIL about ...\" and other broad posts don't belong on TIL. Try /r/Wikipedia, etc. instead, or be more specific (and avoid the word \"about\").\ne. \"TIL how to ...\" posts belong on /r/HowTo.", 
            "No submissions related to the usage, existence or features of specific software/websites (e.g. \"TIL you can click on widgets in WidgetMaker 1.22\")."
        ]
    }, 
    "movies": {
        "popularity": 21494638, 
        "rules": [
            "https://www.reddit.com/wiki/selfpromotion", 
            "If it's a quote from a movie - fine. If it's immature 4channery or something that looks like rhetoric straight out of /r/The_Donald - let us know.\n\nRemember that discussion about derogatory/offensive/sensitive issues often leads to unnecessary conflict.", 
            "Buzzfeed-y and MoviePilot-esque sites should be reported with this label. \n\nAny type of \"This movie is amazing!\" submission that doesn't include the subject in the submission title.\n\nSubmission titles that do not refer to the name of the movie the post is talking about are also bounds for removal under this rule. ", 
            "[Archetypal garbage post that clogs up our /new/ feed](https://www.reddit.com/r/movies/comments/4aanjg/how_does_jakey_bear_change_his_iq_in_every_movie/)\n\nPosts like this will be removed immediately and may result in a possible ban. ", 
            "We usually draw the line around name calling, but intentionally antagonizing users will result in an immediate ban.\n\nRespect differences of opinion, and resist the urge to be defensive or assign blame. Remember that people have different communication styles, and that not everyone is using their native language when using reddit.\n\nInterpret other redditors' arguments in good faith, and give people the benefit of the doubt. When you do disagree with someone/something, try to understand why.", 
            "Example:\n\n[/r/DC_Cinematic brigaded us for removing Batman v Superman TV Spots](https://www.reddit.com/r/DC_Cinematic/comments/409gmh/attention_all_dc_redditors_mods_at_rmovies_are/)\n\nReport possible brigading operations with this tag. ", 
            "TV Spots will be deleted on sight on /r/movies, please see [this post](https://redd.it/40imuz) for more details.\n\nWe recently updated automod to remove posts with the words \"TV Spot\" in it. But that doesn't stop users from submitting them by labeling them as \"clips\" or \"new trailers\". Please use this tag to report garbage TV spot submissions masquerading as \"new content\".", 
            "Anything that isn't official, hard-lined news about comic book movies/Superhero movies will be removed. No featurettes, fan art, parodies, etc.\n\nThat means nothing from HeroicHollywood, nothing from ScreenJunkies Movie Fights or anything from El Mayimbe. \n\nDiscussions are allowed!", 
            "[Light 'em up](http://img.pandawhale.com/post-12180-Avatar-Downvote-GIF-m8gX.gif)", 
            "Try not to offer UNconstructive criticism; offer or at least solicit suggestions on how to change/improve a POV or argument.\n\nBeing snarky and aggressive is not conducive to the great discussion that we've come to know and expect from /r/movies, so keep snipes and insults to a minimum. It is the responsibility of all parties to de-escalate conflict when it arises."
        ]
    }, 
    "videos": {
        "popularity": 21282845, 
        "rules": [
            "* Political videos—including content relating to [social issues which have a clear political element](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_1_-_no_politics)—should be submitted to /r/PoliticalVideo. \n* This includes submissions of current or recent political figures in any context, satire/political-comedy, and posts on political topics from within the last **10 years**.", 
            "* **Or incitement to witch-hunt.**\n\n* No demanding \"Reddit Justice\" (or even regular justice) in any way in post titles or comments.\n\n* Do not post names, Facebook pages, phone numbers, addresses, etc. Fake information (false@fake.com, 123 fake street, etc) also falls under this rule.\n\n* Facebook links are not permitted.", 
            "* No web pages that only embed Youtube or Vimeo videos. \n\n* No URL shorteners.\n\n* No links to playlists or to channel pages.", 
            "* There are many other subreddits for such content.", 
            "* No asking for votes or sharing submission links on or off-site. See [Reddiquette](https://www.reddit.com/wiki/reddiquette) for more details.\n\n* Do not ask other users to follow your social media profiles in comments or submission titles.\n\n* Titles for posts should not try to influence users to view or upvote them.\n\n* Giveaways also fall under this rule\n\n* Violations can lead to a permanent ban of accounts and video channels.", 
            "* You are free to offer your opinion respectfully, but comments or posts intended to demean a group, acontextual expressions of bigotry, and the pejorative use of slurs is disallowed.\n\n* **Baiting users into breaking this rule is not allowed.**\n\n* Telling other users to hurt or kill themselves in any form is against reddit TOS, and will earn you a permanent ban.\n\n* Be kind to users in our community; [remember the human.](https://www.reddit.com/r/blog/comments/1ytp7q/remember_the_human/)", 
            "* No videos of real-life, malicious person-on-person assault/battery or physical abuse of animals. \n\n* This includes raw videos of fights and malicious violence.\n\n* This includes videos of child and animal abuse.\n\n* Public freakout videos belong in /r/PublicFreakout", 
            "* If the video description says: 'for licensing enquiries contact licensing@agency.com', the video is most likely licensed by a third party.\n\n* Videos that become licensed after they are posted will be removed. Please see [this thread](https://www.reddit.com/r/videos/comments/3mvfy4/important_information_regarding_3rd_party/) for a more detailed explanation.\n\n* [Report any messages you receive of suspicious offers to the moderator team.\n](https://www.reddit.com/message/compose?to=%2Fr%2Fvideos)", 
            "* Self explanatory. Audio over a static image or slideshow may also violate Rule 9.\n* This includes music visualizers and lyric videos"
        ]
    }, 
    "Music": {
        "popularity": 21191743, 
        "rules": [
            "**No music from /r/music's [Hall of Fame](/r/music/w/halloffame)**", 
            "**Artist - Title [Genre]** *Optional text*\n\nAll submissions of streaming songs and albums must follow this format or will be removed.\n\nOptional additional text may only be included after this part of the title. No ALL CAPS.", 
            "**No artist reposts for 30 days if the previous post broke 100 points**", 
            "**No clickbait titles or emotional appeals**\n\nMusic should stand on its own. If you have an interesting story behind the music, you can add this in the comments or as self-post text. This rule includes solicitation of votes.", 
            "**No /r/ifyoulikeblank or /r/tipofmytongue style posts**\n\nFor recommendations of new artists similar to those you already like, use /r/ifyoulikeblank. For help with identifying a song, use /r/tipofmytongue or /r/namethatsong.", 
            "**Must link to official artist channels**\n\nExceptions are made for exclusive releases or tracks not available on an artist's official channel.", 
            "**No crowdfunding sites**", 
            "**No links to unauthorized music leaks or promotion of piracy**", 
            "**Discussions and articles should be directly relevant to music, music technology, or the music business itself**\n\nArticles/Tweets discussing statements by musicians not relevant to their work are not allowed. Articles discussing events in musician's lives are subject to mod discretion.", 
            "**Follow [reddiquette](/w/reddiquette) at all times**"
        ]
    }, 
    "IAmA": {
        "popularity": 19399103, 
        "rules": [
            "The point of proof is to connect who you are with the username you are using to host the AMA. All proof must tend to show that the person behind the username is the person they claim to be.\n", 
            "AMAs must be about: Something uncommon that plays a central role in your life, or a truly interesting and unique event.", 
            "In the past, we allowed Request posts in /r/IAmA. This is no longer the case. Requests should be posted to /r/IAmARequests", 
            "Top-level comments must ask a question", 
            "Do not ask for personal favors from an OP", 
            "Users attempting to bypass the rules by adding a ? to a non question will be permanently banned from the subreddit.\n", 
            "Abusive or harassing comments will be removed", 
            "Please See our FAQ listed in the old.reddit.com sidebar for more rules."
        ]
    }, 
    "gifs": {
        "popularity": 19034906, 
        "rules": [
            "* Do not post gifs that have already appeared on /r/gifs . Moderators may allow gifs that have gotten an extremely low score in the past, but that is not guaranteed.\n\n* Do not post gifs that have gotten more than 1500 points (at the time of posting) elsewhere on reddit in the last two weeks. This includes videos converted to gif formats. Cross-posts after this time are allowed. \n\n* Please use Karma Decay to see if your GIF has already been submitted. Frequent violations will result in a ban.", 
            "There are already subreddits more suited for this kind of content.", 
            "Incredibly long gifs ***or content much better suited to video formats will be removed.*** [Duration must be less than or equal to twenty (≤20) seconds.](http://i.imgur.com/RXihRpT.png)", 
            "No links to image pages or albums are allowed, your submission must be a single gif image. **Direct links that end in .gif, .gifv, .ogg, .mp4, and .webm format only.** URL-shorteners are **NOT** allowed in posts or comments!", 
            "There are other subreddits dedicated to this kind of content.", 
            "Do not encourage any online or real-life harassment, and don't encourage people to downvote other posts/comments.", 
            "**These are not allowed in posts or comments - No exceptions.** If it can get you fired then it should not be here. Failure to comply will result in removal of post and banning. There are other subreddits dedicated to NSFW content. **Please mark risque posts and comments as NSFW.**", 
            "Do not make submissions with the title \"This\", \"This is my favorite gif\", etc.", 
            "Racist, sexist, homophobic, or otherwise abusive submissions or comments will result in an immediate ban.", 
            "Please familiarize yourself with the [official rules](/rules) and [reddiquette](/wiki/redditquette). We will remove any posts violating reddit's official rules (spam, personal information, vote manipulation, etc.) and reddiquette just makes reddit a better place to visit."
        ]
    }, 
    "news": {
        "popularity": 19011898, 
        "rules": [
            "A story that is over a week old, does not properly report a story, or is not noteworthy. Self posts and meta posts without moderator approval (live update threads, major breaking news, and megathreads are usually exempt) should go to /r/InTheNews.", 
            "Opinion and analysis should go in /r/InTheNews or another relevant subreddit. This includes articles with editorial opinion, personal conjecture, or otherwise. Press releases with an editorial slant, and analysis of news events (rather than reporting on the event itself) are not allowed. Both articles and domains regarding advocacy for a certain point of view or ideology rather than objective reporting should be reviewed under this rule.", 
            "News concerning politics should be posted in /r/Politics or another appropriate subreddit. Politics in this case primarily means rhetoric pieces, so notable substantial events within political institutions (eg. supreme court decisions in the US, denouncement of actions by a government body, etc.) are reviewed on a case-by-case basis.", 
            "Editorialized titles, written by the posting user or the domain, are not allowed. Titles should be unbiased and strictly factual. When the article itself is titled appropriately, the submission title should be directly sourced from the title or lead paragraph of the linked article.\n\nDon't plug other subreddits in the title; adding cross-post references is not suitable for /r/news.", 
            "Domains which require the user to purchase a subscription or register an account in order to read the full article are not allowed in /r/news. All users should be able to access the article. Domains which are stealing or reposting content from other news sites, or simply rehash another article without adding substance, are not allowed, and users are encouraged to post the original source instead.", 
            "This rule is in relation to already submitted stories which are being rehashed on multiple domains. If a popular story is being submitted while the same event is covered in another post on the front page, or one with sufficient upvotes at an earlier date, it may be subject to removal. If a story was already submitted but did not become popular, then the rule is not applicable. Spamming a story until it reaches the front page is in violation of reddit's sitewide rules and is not allowed.", 
            "Comments containing racist, sexist or bigoted slurs are subject to removal. Comments which promote racism, sexism or bigotry (including a viewpoint in relation to those) are subject to removal, and users whom engage in posting such comments may be banned at the mods' discretion. Overly crude comments which add nothing to discussion are also subject to removal. These include inappropriate or inflammatory comments, personal attacks, etc.", 
            "In conjunction with vitriolic and crude comments, a comment that is unnecessarily rude (inflammatory comments, personal attacks) or purposefully provocative (baiting) are subject to removal.\n\nAdvocating for or celebrating the death of another human being is grounds for a permanent ban from r/news. Regardless of what you think about a person, this type of discourse is unwelcome on r/news and we will not hesitate to remove you for it.\n\n", 
            "Jokes, memes, puns, and overall low quality comments are subject to removal, especially in the top-level comments.", 
            "Any thread which violates reddit's site-wide rules or invokes a witch-hunt is not allowed in /r/news.\n\nContact information publicly advertised by the person or organization in question is allowed so long as it is not being used to incite personal harassment, and doesn't contain personal contact information (home phone number, information of non-public family members, etc.) **To ensure that such comments aren't removed, provide a link to the official page where this information is contained.**"
        ]
    }, 
    "EarthPorn": {
        "popularity": 18596273, 
        "rules": [
            "If you are submitting an image where the land is silhouetted, it will be removed and referred to /r/skyporn.", 
            "If you are submitting an image with man made objects or people present, unless they are very small and barely noticeable, it will be removed and referred to /r/ruralporn or another appropriate network subreddit.", 
            "Your submission title should include the geographical location. If you don't know the geographical location please use Google Reverse Image Search on the image.", 
            "Include the photographer's name/username in the title. If you are posting your own image, you do not need to put the name/username, but make sure to tag it with [OC] as doing so will earn special flair. Images that have no credited name/username nor tag will be removed.", 
            "Include the correct resolution in [brackets] in the title. Posts without a resolution tag will be removed.", 
            "Do not name or reference the device you used to take the photograph you are posting in the title of your post. This information should be posted in the comments.", 
            "Videos, compilation photos/albums, interactive images/websites, and articles are not allowed.", 
            "Do not edit, rehost or modify images submitted here without permission of the photographer. This includes edits to \"fix\" the colors of an image or remove a watermark.", 
            "Regarding reposts: it is only a repost if it was posted to /r/EarthPorn less than three months ago, or if it is already in the top 100 of all time.", 
            "No photos that break any laws, e.g. trespassing in a National Park or flying your drone in a no-fly zone. See this thread for more information: https://www.reddit.com/r/EarthPorn/comments/9z4z59/rule_announcement_photos_taken_illegally/"
        ]
    }, 
    "Showerthoughts": {
        "popularity": 18454226, 
        "rules": [
            "Submissions that match (or echo similar sentiments to) ideas offered by other people will be removed, regardless of whether or not those ideas have appeared on Reddit. Blatant reposting and plagiarism may result in a ban.»", 
            "Personal perspectives, crazy ideas, questions (rhetorical or otherwise) and meta submissions are not showerthoughts, and would be better suited to other subreddits. For an in-depth explanation of what a showerthought actually is (and is not), please read [this page](https://www.reddit.com/r/Showerthoughts/wiki/overview).", 
            "You may include examples, explanations, or further information in the body section, but all posts to /r/Showerthoughts must stand on their own as nothing but a title.", 
            "Thoughts directly related to being in the shower (or anything related to the bathroom) will be removed.", 
            "While showerthoughts may be humorous in nature, posts which are explicitly comedic should be kept to other subreddits. Puns and wordplay are similarly disallowed.", 
            "Posts intended to inform users of tips, tricks, life-hacks, or useful practices (whether serious or not) should not be offered here.", 
            "Posts which include any mention of Reddit, subreddits, karma, or anything tangentially related are not allowed here.", 
            "Posts which include any mention of politics, religion, or social justice (or concepts, figures, and ideas tangential to those topics) are not allowed."
        ]
    }, 
    "askscience": {
        "popularity": 18103284, 
        "rules": [
            "Medical advice is strictly prohibited on AskScience. Asking for or soliciting medical advice are both against the rules.", 
            "AskScience has a strict policy against abusive and offensive language. Unless that language is in the context of research, it has no place here. We hold comments and posts to a high level of professionalism. We require our users and volunteers to always maintain a level of professionalism in order to participate.", 
            "Homework questions are something that AskScience feels their experts should not be answering but instead should be answered by the person assigned the homework. While this is not always clear cut and is sometime up for personal interpretation, please report anything you believe to be homework.", 
            "Memes, jokes, or comments consisting solely of a link are not allowed.", 
            "Top level comments (direct replies to a question, not a reply to another user's comment) must be an answer to the question posed, or a follow-up question to the post.", 
            "Answers should be supported by reputable sources and scientific research. Do not cite yourself as a source.", 
            "If the question can be answered with a Google search, it is not appropriate for r/AskScience. Further, no simple calculations are allowed."
        ]
    }, 
    "Jokes": {
        "popularity": 17203916, 
        "rules": [
            "Personal attacks will not be tolerated. If you want to be a dick, go to /r/insults", 
            "Please only report reposts if they have been posted recently - not because you've seen the joke before.", 
            "It's actually, 100% legit spam.", 
            "3 joke limit.", 
            "Jokes must be in text format, no emoji's or linking allowed. (YouTube, Imgur, etc)\nJokes are required to have a title and a punchline in the text box [deleted] and [removed] are not valid punchlines.", 
            "If you post a NSFW image/link in the comments, it must be tagged as NSFW (Nudity/gross images) or NSFL (Gore/extremely disturbing images, and only if relevant to the conversation)", 
            "This subreddit is not a platform for blatant self-promotion - this includes asking users to subscribe to other subreddits."
        ]
    }, 
    "explainlikeimfive": {
        "popularity": 17141035, 
        "rules": [
            "Stay respectful, polite, and friendly. ELI5 is a for requesting help understanding complex concepts and sharing explanations [without fear of judgement](/www.reddit.com/r/explainlikeimfive/comments/j28z5/welcome/). Don't insult people or their good intentions in a post, comment, or otherwise, even if a person seems rude or ill-informed. Remember the positive spirit of ELI5. \n\nThis includes plagiarism - acknowledge your sources! \n\nUse of bigoted slurs, directed at other users or not, is uncivil.", 
            "ELI5 is not meant for any question that you may have. It is meant for simplifying complex *concepts*. \n\nNotably, posts will be immediately removed that ask for:\n\n- Information about a specific issue (personal experience, legal/relationship advice, medical questions, etc.)\n- Subjective/speculative replies\n- Straightforward answers/facts\n- Recent/current events\n- Religion/Politics\n- Hypotheticals\n- Questions about Reddit itself/help. \n- Whole topic overviews\n- Business/Group/Individual motivations", 
            "Replies directly to OP must be written explanations or relevant follow-up questions. They may not be jokes, anecdotes, etc. Short or succinct answers do not qualify as explanations, even if factually correct. \n\nLinks to outside sources are accepted and encouraged, provided they are accompanied by an original explanation (not simply quoted text) or summation.\n\nExceptions: links to relevant previous ELI5 posts or highly relevant other subreddits may be permitted.\n", 
            "Unless OP states otherwise, assume no knowledge beyond a typical secondary education program. Avoid unexplained technical terms. Don't condescend; \"like I'm five\" is a figure of speech meaning \"keep it clear and simple.\"", 
            "All comments must explain, ask about, correct or address facts. Trying to change someone's opinion or influence them with yours is not appropriate.\n\n\nIf you are not able to submit, discuss or correct factual information without implicitly or explicitly involving your personal view on the matter, do not post.", 
            "A loaded question presumes a controversial or not obviously true statement as fact. \"ELI5: Why was Obama the president when he wasn't born in the US?\" is loaded. \"ELI5: The controversy about where Obama was born\" is a non-loaded way to ask about the same topic.\n\nIf your question boils down to: \"Why isn't this thing I believe (or is self evidently true) the case?\" your question is loaded and belongs in another subreddit.", 
            "To avoid duplication, search for your key words, not your whole title. If you found only explanations that weren't clear on your point, explain that, and state what you're still trying to understand.\n\nYou can read more on our reposts policy [here](https://www.reddit.com/r/explainlikeimfive/wiki/reposts).", 
            "If you don't know how to explain something, you don't need to reply. If you have a partly educated guess, only comment on the parts you are sure of.", 
            "If the automatic moderator removes your post, read the whole message it gives you, and follow its advice. It's there to help, not to be evaded — evasion will result in a ban.", 
            "This is meant to help identify ELI5 posts on the frontpage or /r/all or any other collection. \n\n\n-----\n\nModeration decisions are ultimately left up to the discretion of the ELI5 modteam. Do not try to find loopholes in the rules and sneak through them. Above all else, respect the spirit of the subreddit."
        ]
    }, 
    "books": {
        "popularity": 17070014, 
        "rules": [
            "Rule 1: All posts must be directly book related, informative, and discussion focused.", 
            "Rule 2: Please use a civil tone and assume good faith when entering a conversation. Please conduct yourself as though in a family-friendly environment. Do not use obscenities, slurs, or gender-charged insults.\n\nIncivility will be met with a warning, and repeat offenders will be banned.", 
            "Rule 3.3: Requests for personalized recommendations or suggestions are not allowed. Post instead to our Weekly Recommendation Thread (always CSS stickied at the top of any /r/books page), /r/suggestmeabook or /r/whattoreadwhen. Also try /r/booklists or our Suggested Reading list wiki page. Posts asking users to list their favorite/the best book of a genre, style, etc that don't include an answer and why in the body will be assumed to be recommendation requests and removed. ", 
            "Rule 3.4: \"What's that book called?\" posts are not allowed. Post instead to /r/whatsthatbook or /r/tipofmytongue. ", 
            "Rule 3.1: Promotional posts and/or comments need to meet the promotional rules requirements: [please see the wiki for more details](http://www.reddit.com/r/books/wiki/promotion). This includes surveys and market research. \n\nIf you are posting your own content, you must meet  all other /r/books rules, you must meet the 9:1 ratio, you must make it a self-post and you must be up front in the title that it is your own work.", 
            "Rule 3.6: No distribution or solicitation for pirated books. We aren't telling you not to discuss piracy (it is an important topic), but we do not allow anyone to share links and info on where to find pirated copies. This rule comes from no personal opinion of the mods' regarding piracy, but because /r/books is an open, community-driven forum and it is important for us to abide the wishes of the publishing industry.", 
            "Rule 3.9: If you do not mark your post or comment as having spoilers it will be removed. Any posts with a spoiler in the title will be removed. \n\nSpoiler tags in comments are done like the example below if you are using markdown or use the built-in spoiler tags on the redesign.\n\nHow to spoiler tag:\n>! spoiler here !< displays as\nspoiler here", 
            "Rule 3.12: Obvious requests for homework where the OP has done little/no work will be removed. As an alternative there is /r/HomeworkHelp. Please read their rules before posting over there. ", 
            "Rule 3.2: No memes, image-macros, image-only, or video-only posts. You may make a self-post and include with it an image or video, keeping in mind Rule #1. Please note: shallow posts are not allowed but you are allowed to post if you give some information of elaboration along with the image.", 
            "3.8: No low quality book lists (eg: Buzzfeed). To maintain quality, the list must encourage discussion. The list itself must have descriptive paragraphs for each book. Users are also encouraged to submit their own unique lists as a self-post. Alternatively, there is /r/booklists.", 
            "Please read the r/books full rules and guidelines [here.](https://www.reddit.com/r/Books/wiki/rules)"
        ]
    }, 
    "food": {
        "popularity": 16779254, 
        "rules": [
            "We enforce reddiquete as a rule here. [Reddiquette](https://www.reddit.com/wiki/reddiquette)\n\nDo not call other user's food shit, nasty, disgusting, etc. Don't like it? Move along. There are tens of thousands more images to choose from.", 
            "Do not post in response to other posts or to inflame.\n\n\nNo crudeness, sexually or digestively.\n\n\nNo comments like diabetes or heart attack etc.\n\n\nNo memes or social media.\n\n\nVideo links are heavily scrutinized, must be solely relevant to food and must abide by the self promotion/spam guidelines, whatever the source.\n\n\nOnly official YT channels allowed, celebrity chef/otherwise approved channels.\n\n\nNo surveys, Kickstarters, research help or requests for money.\n\n\n2 posts per 24 hours per user.", 
            "This rule includes posts or comments, links embedded in imgur descriptions, watermarks on images, linking to blog sites, including wordpress and blogspot and any other form of redirect links, domains or otherwise excessive self promotion.", 
            "Use np.reddit.com links when linking to other subs or to this one.", 
            "Keep Titles descriptive and just about the food.\n\n\nPosts with titles that do not describe the link contents will be removed without notice.\n\n\nPhrases that are not descriptive of the food and tell a backstory of the food, including it's price, location, who, where, when or how will be removed.\n\n\nIf you are going to post a compilation album, you must describe the first three dishes.\n\n\nDo not title food as vegan/vegetarian/keto/GF, use the flair instead.\n\nAvoid all caps.", 
            "Use one of the following tags for Link posts: [Homemade], [I ate], [Pro/Chef], [Found], [Request/Discussion], [Misc].\n\nIf you have questions on what they mean, message the mods or visit out wiki [HERE.](https://www.reddit.com/r/food/wiki/index#wiki_rules)\n\n\nUsers may post one (1) non-OC image for every four (4) OC images of food.", 
            "We are a general food sub and do not endorse any dietary regimen over another.\n\nWe do not allow users to promote their dietary lifestyles or anything politically related here. There are other subs for that.", 
            "This includes crossposts to /r/wewantplates and other shitty subs.\n\n\nKarmawhores will be dealt with swiftly. "
        ]
    }, 
    "LifeProTips": {
        "popularity": 16640115, 
        "rules": [
            "Troll, Joke or unnecessary LPTs (e.g. LPT: Breathe, or LPTs about defecation, masturbation, or urination).\n\nSee also our list of DISALLOWED TIPS.\n\nhttps://www.reddit.com/r/LifeProTips/wiki/commonlpts ", 
            "Also, no referral links or self promotion. ", 
            "Full list can be found in the sidebar\n\nhttp://www.reddit.com/r/lifeprotips/about/sidebar", 
            "Homophobia, racism, harassment and general hate on ethnicity, sex, religion or anything else. Also, Comments with ill intent/not following the reddiquette."
        ]
    }, 
    "DIY": {
        "popularity": 16548681, 
        "rules": [
            "All projects must provide progress photos and sufficient descriptions of how you completed the project. This includes how the project started, the duration of the project and the end of the project.\n\nYou must detail the majority of the project and explain the steps you took, including the tools used. Do not assume people can figure it out based on photos. /r/DIY is an education subreddit and you should provide that information.\n\nThis same information applies to videos - voiceover is required.", 
            "Do not submit a project before it is finished. This includes multi-part projects (part 1 of x). Wait until it is 100% finished before submitting", 
            "Only ask specific questions regarding a project you are currently working on. We don't permit questions regarding what colors would look nice (aesthetics), where you can buy a product, what an item is called, or product recommendations. This is not a full list of exclusions.", 
            "/r/DIY is not your personal search engine. Before asking a question - do research on the matter. Most answers can be found within a few minutes of searching online. For example - most appliance manuals can be found online, how to paint/stain furniture can be found online.\n\nIf you have already done research and it did not answer your question(s) - make sure you explain what research you've done in your post so that others don't waste time following those same paths.", 
            "Prohibited Projects include crafts, general maintenance items, CNC/Laser cutting/3D printing projects in which the project is primarily complete with those methods, software projects, cooking, sewing, and cosmetics.\n\nThis is not an exhaustive list. Please read the rules for more information.", 
            "/r/DIY only permits OC. Do not submit something that your father, son, mother, uncle or grandfather made. ", 
            "We permit only 1 link to your blog / YouTube / website / etc. It does not matter where you put that link - in the title, in the Imgur descriptions, on Reddit, etc. One link and one link only. Violations of that will get your post removed.\n\nYou can watermark your images / videos with anything other than a URL", 
            "The OP spent time to share their project. If the post starts to derail we will remove comments that are off topic.", 
            "Be civil. Treat everyone appropriately. /r/DIY is a support community. If you disrupt it we will remove you."
        ]
    }, 
    "mildlyinteresting": {
        "popularity": 16500990, 
        "rules": [
            "No memes. This includes references in titles of your post (e.g. \"banana for scale,\" \"potato quality\").", 
            "Related posts must be in the comments of the original. Posts that acknowledge, \"one-up,\" or relate specifically to another post are not allowed (e.g. \"I see your X and raise you Y\")", 
            "Do not post something that has been submitted to reddit before, even if you were the one who posted it.", 
            "a. All submissions must be original and non-animated *photographs*.\n\nb. All submissions must be original content. If you didn't take the picture, don't post it.\n\nc. Software glitches/errors, overlaid text, arrows, scribbles, and other substantive edits are not allowed, although you may censor personal information per Reddit-wide rules.\n\nd. Side by side images are okay if they adhere to the rest of the rules.", 
            "No screenshots. We define a screenshot as a screen grab. This means no images of screens, pictures of screens taken with a different device, images that have been partially or fully generated by a computer, or pictures of printed out screenshots. Try /r/screenshots!. ", 
            "a. Titles must not contain jokes, backstory, or other fluff. That information belongs in a follow-up comment.\n\nb. Titles must exactly describe the content. It should act as a \"spoiler\" for the image. Specify what your picture shows; do not simply say “I saw this” or something similar. If your title leaves people surprised at the content within, it breaks the rule!\n\nc. Titles must not contain emoticons, emojis, or special characters unless they are absolutely necessary in describing the image."
        ]
    }, 
    "Art": {
        "popularity": 16284431, 
        "rules": [
            "Artwork - Title, Artist/Me, Medium, Year\n\nIf you are the artist and don't want to use your own name, you can use Me as the artist. If you are not the artist, you must specify the artist name.\n\nExample: The Night Watch, Rembrandt, Oils, 1642\n\nNews article - Title, Year\n\nDiscussion - make it a self post. Expand on your question in the text and include image examples when possible.\n\nVideos - Videos should be titled in a way consistent with it's content. Videos must be in the gif format.", 
            "All submissions other than articles must be a direct link to a static image or gif (url must end in .jpg, .png, .gif etc.).\n\nArticles must contain more substance than just a gallery of images or an embedded video, and they must cover some current news in the art world. \n\nImages should only contain 1 art piece.\n", 
            "You must wait at least 48 hours between posts. \nExcessive posts/comments could be considered spam and result in a ban.\n\nPlease use rolling stickies for daily challenges or special threads.\n", 
            "Post these to other subreddits like /r/IDAP, /r/sketches and /r/doodles instead. If it's an unfinished work and you need advice, post it as a self-post and indicate in the comments that you're looking for feedback or advice. \n", 
            "We're here to look at art, not your Prismacolor pencils, the desk you framed your painting over, your easel, or anything else that would not be seen if the art were publicly displayed.", 
            "Low effort submissions may be removed. Melted crayon \"art\" and bad MSPaint drawings are subject to a 3 day ban. This rule is totally up to mod discretion.\n", 
            "Submissions that don't fit here may be redirected to more suitable subreddits like /r/fanart, /r/artporn, or /r/comics. Requests for art work should be submitted to /r/designjobs instead.\n\nSee here: https://old.reddit.com/r/art/wiki/fan_art", 
            "Bigotry, slapfights, unconstructive criticism, and off-topic comments will not be tolerated and may result in all parties being banned.", 
            "/r/art is not a place to sell your work or grow your following. Consider /r/artstore. This applies to comments _and_ submissions. It applies to watermarks on images as well. \n\nAlso see here if you're using reddit for self-promotion: https://www.reddit.com/wiki/selfpromotion\n", 
            "Do not add any extraneous information, or be subjective in your title.\n\nPlagiarism is grounds for a permaban.\n\n**Note: When rules are updated on \"old\" reddit they do not automatically update on the redesign. If your post is removed for a reason that doesn't seem to align with the rules currently please check http://old.reddit.com/r/art for the most up-to-date info.**\n\nIf you see rule-breaking content report it by clicking the \"report\" button or messaging the moderators directly via modmail."
        ]
    }, 
    "sports": {
        "popularity": 16081207, 
        "rules": [
            "* No memes.  \n* No joke posts.  \n* No video games or \"eSports\"  \n* No pictures with text.  \n* No screenshots showing people/actions in freeze frame, or of websites/social media.  \n* Duplicate content will be removed. \n* NSFW content must be relevant to sports and marked appropriately.\n* Better sources for video/images must be used whenever available (No videos of TV screens for highlights)\n* Direct links to video highlights using streamable/imgur/v.reddit/etc are mandatory", 
            "* Posts with misleading/sensationalized/editorialized/ambiguous titles are prohibited. The title must clearly and thoroughly describe the post. \n* ALL-CAPS titles are prohibited. Emojis, hashtags, clickbait-type titles and all other methods of attention-grabbing are prohibited.\n* Submission Flair is required. All posts without flair will be removed.\n* Do not mention votes/karma or other reddit verbage.\n* No posts to communicate with another redditor. Calling out other users is prohibited.", 
            "* If your submission history is mostly from your own blog, vlog, podcast, channel or website - it will be removed and you will be banned. ALL self-promotion will be removed as dictated by site rules. \n* Do not use this subreddit to ask for or offer any goods or services.\n* If you ask for any illegal content or if you help guide somebody to it, you will be banned. \n* Comment spam will be removed. This includes bots, novelties, and editing comments to change the meaning/troll/advertise.", 
            "* Making comments or posts with another person’s personal information (name, social media, phone number, etc) that is not publicly available is against Reddit’s rules and will earn a ban and report to the admins.", 
            "* No racism, sexism, slurs, etc.  \n* Threats, suggestions of harm, personal insults and personal attacks are prohibited. \n* No posts/comments created for hate, trolling or slapfights.  \n* Comparing or ranking different sports, athletes, fanbases or nationalities is prohibited.  \n* Calling out a specific user or taking part in/encouraging witch hunting will lead to a ban."
        ]
    }, 
    "space": {
        "popularity": 15877348, 
        "rules": [
            "This includes \"circlejerky\" submissions or space-related art, with the exception of art from space agencies or historically-significant art.", 
            "This also means that news articles should be a top-level source.\n\nNews articles about space-related crowdfunding campaigns are allowed, but direct links to crowdfunding campaigns are not allowed.", 
            "Images, gifs, and gif-like videos (those under 2 minutes and which don't rely on sound) are permitted only on Sundays UTC. No low-effort or meme images are permitted at any time.", 
            "Straightforward questions (who/what/where) belong to the Weekly Space Questions thread (pinned at the top)."
        ]
    }, 
    "gadgets": {
        "popularity": 15838317, 
        "rules": [
            "Submissions must be explicitly about a single gadget:\n\n* Posts about software or tech companies will be removed\n* Gadget concepts that do not physically exist are also not gadgets", 
            "Self-promotion is not allowed. Do not submit links to sites that you are affiliated with. Native advertising and \"advertorials\" are also not allowed.", 
            "Submissions about pre-release or pre-order products are subject to these rules/conditions:\n\n* The article must be from a white listed source\n* The article must be about the gadget - not the company, its business practices, delivery dates, etc.\n* The submitter must not be affiliated with the campaign, company, or website", 
            "No direct image or video links are permitted", 
            "Describe the gadget in your post title. No sensationalized, misleading, or non-descriptive titles.", 
            "Articles must be about a single gadget - listicles are not allowed", 
            "Keep discussions civil and respectful! Comments should be on-topic and contribute to the conversation", 
            "No adult material (NSFW/NSFL, etc)", 
            "* Solamente inglés\n* Que l'anglais\n* 仅限英语\n* Nur Englisch\n* Chỉ tiếng Anh\n* الانجليزية فقط\n* सिर्फ अंग्रेजी\n* Tylko angielski", 
            "If you need advice about a gadget, you should ask in the weekly advice superthread.", 
            "Avoid blogs/websites that rehost content without giving credit. Exact copies are never allowed, as are copies that are just slightly rewritten versions of original article", 
            "Please be sure to follow the reddit site-wide rules which can be found here: reddit.com/rules"
        ]
    }, 
    "nottheonion": {
        "popularity": 15775275, 
        "rules": [
            "The title of your submission should match the article's headline exactly. Copy and paste from the article, leaving out any subtitles, bylines or other information. The Suggest Title tool is discouraged, as it often does not match the headline. The **only** exception to the rule is that titles in ALL CAPS may be changed to Title Case.", 
            "Both the title and body of your article should sound like something The Onion would write. This can be highly subjective - there's no one-size-fits-all guide to what fits here. Moderators may rule posts Not Oniony at their own discretion.\n", 
            "Submissions must be full news articles (not blog/social media posts, images, or videos).", 
            "Use only original, reliable sources for your articles. Sites that frequently rehost stories are on the [Autoremoval List](https://www.reddit.com/r/nottheonion/wiki/autoremoval). Blogs, tabloids, activist pages or satire websites are not reliable sources.", 
            "Check for articles on the same story using the Search function and current posts. Do not post if your article is the same or similar to one that has already been posted. **Frequent violators of this rule will lose their posting privileges.**", 
            "Keep comments civil and avoid attacking other users directly.", 
            "Any form of bigotry will not be tolerated.", 
            "Articles must have been written within two weeks of the submission date.", 
            "Do not post non-English articles, or use google translate on one. Try to find an English source for the article.", 
            "Do not post mobile versions of articles (identifiable by .m or .mobile in the URL). Make sure the site you're submitting from does not have a paywall or surveywall to access content. Do not post that redirect to a different address. This includes link shorteners and .amp links."
        ]
    }, 
    "television": {
        "popularity": 15724281, 
        "rules": [
            "* No spoilers in submission titles are allowed. \n\n* Comments containing spoilers must also be properly spoiler tagged *using the code in the sidebar*, unless the context indicates otherwise. \"Context\" means expect **untagged** Breaking Bad spoilers in a Breaking Bad thread unless OP specifies or implies otherwise, e.g. the title is \"I'm on the first season of Breaking Bad, does it get better?\"\n\n* There is no age exception for spoilers, it does not matter how old the book, show, movie etc. is.", 
            "Requests for or links to streams, torrents, etc. will be removed. Posts that appear to be veiled requests for piracy may also be removed.", 
            "* If multiple links about the same news/article/etc. are submitted, only one submission will be allowed to stay.\n\n* Old news will likely be removed, especially if it has been submitted before and/or does not clarify in the title that the news is old.\n\n* This rule is not enforced for text post threads whose primary purpose is not sharing or discussing a link. An example is multiple threads made by different users submitting their opinion of a newly released show - that is allowed.", 
            "Articles that are list based, such as \"22 facts you didn't know about Game of Thrones!\", or \"10 shows to watch this summer!\" will be removed. Mostly this is to remove low quality content, but some listicles may be allowed to remain if they are informative and well-constructed.", 
            "See the following link for the full description of this rule: https://www.reddit.com/r/television/wiki/rules#wiki_8._some_politics", 
            "Titles should indicate what a user can expect to see or read in your link and should attempt to remain relatively neutral. Vague and sensationalized titles may cause your submission to be removed. Titles should also be free of spoilers. Titles should not contain the website's name from the link, e.g. \"HBO is developing a new show about pirates | E Online\". Titles that are sufficiently misleading may also cause the submission to be removed.", 
            "Users who are engaging in personal attacks or are otherwise being overly hostile or rude may have their comments removed and may be banned.", 
            "All requests for recommendations should be in our weekly [recommendation thread](https://old.reddit.com/r/television/search?q=flair%3A%22Weekly+Rec+Thread%22&restrict_sr=on&sort=new&t=all). It is acceptable to create threads to recommend shows to other users, or to post a thread concerning a specific show. \"Should I watch Breaking Bad?\" is fine as it prompts discussion of a specific show. A thread such as \"Can you give me shows like Breaking Bad?\" is not allowed. Do not be a \"help vampire\".", 
            "Requests for help to remember something should go to r/tipofmytongue. People looking for help to find where to watch something should use justwatch.com or an alternative.", 
            "Where possible, we prefer that the original source of news be posted, except where prohibited by other rules (e.g. the source is a tweet). Articles that post about an excerpt of an interview made for another publication are also fine.", 
            "The personal lives of people who work in the entertainment should not be posted about unless it is news that may substantially impact their career or some work (e.g. a debilitating illness).", 
            "Something airing on television, or something concerning a person who has appeared on television, does not necessarily make it relevant to r/television.", 
            "This rule set primarily describes rules not enforced automatically through u/AutoModerator. You can view a more detailed list of rules [here](https://www.reddit.com/r/television/wiki/edit/rules)."
        ]
    }, 
    "photoshopbattles": {
        "popularity": 15413351, 
        "rules": [
            "* Titles should objectively describe what's visible in the image.\n\n Non-descriptive titles, such as `this has potential`, `what is he doing?`, `make this epic` or `this cat/dog/baby` are no longer permitted.\n\n* Please avoid:\n * Making jokes\n * Giving suggestions\n * Contextualizing, or giving background info\n * Sharing personal anecdotes\n * [Mentioning your connection to the image](https://np.reddit.com/r/photoshopbattles/comments/2xcj5q/my_blind_husband_juggling_our_rescue_dog_cat_and)", 
            "Please do not post requests on /r/photoshopbattles.\n\nSubmissions seeking specific modifications, such as `please touch-up this photo`, can be posted to /r/picrequests or /r/photoshoprequest.", 
            "* Image links must be in the form of a single, static image.\n\n GIFs, albums, and tiled images are not permitted.\n\n* The URL posted should be a direct link to an image file; i.e. it must end in `.jpg` or `.png`\n\n With Imgur:\n\n http://imgur.com/R9j1gvQ is an HTML webpage containing an image.\n\n http://i.imgur.com/R9j1gvQ.jpg is the direct link to the image itself.", 
            "For the purpose of maintaining the quality of content on this subreddit, please refer to the [full rules regarding image content](https://www.reddit.com/r/photoshopbattles/wiki/submissionrules#wiki_image_content) prior to submitting.", 
            "Please do not delete your thread if there are any photoshops on it. If there are and you feel you must, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fphotoshopbattles) first. If it is found that you are deleting threads with photoshops to maximize karma or without good reason, you will have your posting ability revoked. This subreddit is first and foremost a platform for photoshoppers to create their work and be seen, please do not impede this.", 
            "NSFW tags must be used generously.\n\nSexually suggestive or gore-y images may also be removed at the discretion of the mod team.", 
            "Junk comments distract from this subreddit a lot more than in other subreddits that are not based on original content.\n\nComments that are cliche, text-only, not an original work, memes, reaction gifs, upvote gifs, or off topic are subject to removal by the moderators without notification.", 
            "Top-level comments must contain an original photoshop.", 
            "Titles must begin with \"PsBattle: \" exactly"
        ]
    }, 
    "Documentaries": {
        "popularity": 15331119, 
        "rules": [
            "Posts which are not documentaries will be removed.", 
            "Soliciting for donations is annoying and prohibited.", 
            "Posting format: DocumentaryTitle (year) - \"optional short description of the documentary\". The use of [Trailer] or [Preview] tag is required. A [CC] tag is strongly encouraged.", 
            "Mods reserve the right to apply the don't be a jackass rule. Please be respectful to other users... if they're wrong, tell them why! But please, personal attacks or comments that insult or demean a specific user or group of users will be removed and result in bans. ", 
            "The linked page must contain a playable video, and shouldn't be an embedded video from another site.", 
            "A popular submission contains many conversations by a wide range of users.  Please don't consign their comments to the memory hole by deleting your popular submission, even if the documentary has been removed from an external site.", 
            "Do not repost documentaries that have been posted in the previous three months.\n", 
            "Linking to your own YouTube channel etc is annoying and prohibited, as is asking for donations or material support. If posting your own documentary, please message the mod team first.", 
            "Ensure the documentary title is correct. The title is often not the same as the YouTube submission, please take care."
        ]
    }, 
    "listentothis": {
        "popularity": 15188661, 
        "rules": [
            "The artist or the featured artist exceeds the popularity threshold. Full rules can be found in the [wiki](https://www.reddit.com/r/listentothis/wiki/rules).", 
            "Personal association and/or self-promotion are only allowed in the weekly music melting pot threads.", 
            "Harassment, threats, and use of slurs or demeaning comments are not welcome. We're all here to enjoy good music and to have a good time.", 
            "Links should go to the artist's official channel whenever possible. ", 
            "Submitted track is a cover or remix of an artist or song that is over our popularity limits.", 
            "The post has been erroneously removed after resubmitting. Please review and approve. ", 
            "All submitted tracks should follow the preferred format:\n\n> MainArtistName -- trackName [genre / genres] (year)"
        ]
    }, 
    "GetMotivated": {
        "popularity": 15144265, 
        "rules": [
            "All Posts MUST be tagged\n\nAll new submissions require one of the following tags to be included in the title:\n\n|||\n:--|:--\n|[Article] | links articles, blogs etc |\n|[Discussion] | text-based discussion |\n|[Image] | all image content |\n|[Meta] | discussion of the subreddit |\n|[Story] | text-based story |\n|[Text] | text not story/discussion |\n|[Tool] | improvement tactics & tools |\n|[Video] | all video content |\n", 
            "This sort of language includes racist, misogynistic, sexist, aggressive, or overtly offensive comments. These comments, whether intended to be a joke or not, are prohibited. /r/GetMotivated  is a place to find Motivation, not a place for denigration and condescending attitudes. Additionally, please refrain from harassment and non-constructive criticisms. **Commenters can and will be banned for such behavior at the discretion of the mods and the comments will be deleted without warning.** ", 
            "In an effort to reduce spam, posting rights are restricted to users meeting a minimum account age and minimum combined karma.  Further, a minimum amount of content in the text box is required to clarify your question or provide context to a linked article.  Any user or post not meeting these minimum requirements will have their post automatically removed but will be messaged with the appropriate options and outlets. **There are no minimum requirements for comments.**", 
            "Advertising of services, products, apps, websites, or fundraisers is not allowed here. GetMotivated is not a platform to drive traffic to you or your friends. [Reddit has a built-in system for advertising](http://www.reddit.com/advertising) which you should use instead. All direct advertisement will be removed without notice. \n", 
            "Comments that are non-constructure, malicious, off-topic or otherwise rule-breaking will be removed without warning.  It's not possible to keep everyone happy, so we will focus on maintaining a subreddit with positive, constructive comments which are on-topic.\n\nParent comments must also be directly relevant and motivating to the original post. ", 
            "\n**This type of content is OKAY and encouraged to post**\n\n- Motivational quotes, where the author is given credit\n- Motivational charts, diagrams and information. \n- Original content that motivates you.\n- Motivating conversation/text/ message that you screenshot.\n- Motivational cartoons/drawings."
        ]
    }, 
    "UpliftingNews": {
        "popularity": 15047979, 
        "rules": [
            "RULE #1: DON'T BE A DICK", 
            "Reposted article"
        ]
    }, 
    "tifu": {
        "popularity": 14808111, 
        "rules": [
            "A. **TIFU** stands for today I fucked up, which means something you did that is your fault. Just because something bad happened to you doesn't mean it's a fuck up.\n\nB. **TIFU** must be at the beginning of the post title or it will automatically be removed. \n\nC. **TIFUpdate** if you are posting a follow-up post to update us on your story. ", 
            "A. **Uninspired** as in something that is super common, lacking in imagination or originality.\n\nB. **Context** as in the story doesn't have any more info beyond the title. *note*: All posts must contain at least 750 characters of meaningful content.\n\nC. **Shitpost** as in literally involving defecation or other bodily fluids.", 
            "D. **Overly vulgar** includes obscene situations, such as, but not limited to, incest, minors, death and assault to humans and animals. Consensual situations between two, unrelated adults should be fine. Vulgar does not mean using bad words. \n\nE. **Illegal activities** that you glorify or giving advice on how to do something illegal.\n\nF. **Not Your Fault** as in it was just something bad that happened to you; if it wasn't directly your fault, it wasn't your fuckup.", 
            "A. **TL;DR** or too long didn't read which is a summarization of your post in a few bitesize sentence. At minimum, your TL;DR summary must contain your fuckup and its consequences. You may include additional information if you'd like. The TL;DR must be at the very end of your post.\n\nB. **NSFW** or not safe for work. If you're not sure if it's NSFW or not, better to be safe than sorry. \n", 
            "A. **Be civil** means don't do these things; personal attacks, harassment,  trolling, and bigotry. Use your better judgement. \n\nB. **Disruptive** such as posting, or seeking, any identifying personal information (real/fake). This includes yourself or others, and refers, but is not limited to, names, phone numbers, email addresses, or any social media accounts. As well as brigading with either votes or comments.", 
            "A. **Spam**, don't link to things that you may or may not be rewarded for. Posting links of you narrating a story is considered spam.\n\nB. **Bots** are annoying and will be banned.\n\nC. **Advertising**, we are not a platform for you (Patreon or charities) or your products, seek https://www.redditinc.com/advertising instead.", 
            "If one of these cases is true, then your story is not considered a fuckup:\n\nA)  Nothing bad happens, or mundane situation.\n\nB)  Not your fault.\n\nC)  Results in death."
        ]
    }, 
    "InternetIsBeautiful": {
        "popularity": 14389822, 
        "rules": [
            "Something not unique (includes generators, blogs, tumblrs, etc.).  Something everyone on the internet already knows about (e.g., Netflix, Khan Academy, etc.)", 
            "Games are not allowed", 
            "Static images, gifs, animations that serve the same purpose of gifs or collections of either.  Video players, articles or collections of either are not allowed", 
            "Online stores, paid services, or sites which serve only to sell a specific product. ", 
            "Websites that require a login or email address. Includes Facebook, Google+, or otherwise.  Websites that require a webcam.", 
            "Extensions, software, or other content which requires a download to use.", 
            "Website is slow or unresponsive. Reddit has hugged it to death and the site needs a timeout."
        ]
    }, 
    "history": {
        "popularity": 14258038, 
        "rules": [
            "Personal attacks, abusive language, trolling or bigotry in any form is not allowed. No hate material, be it submissions or comments, are accepted. Follow [reddiquette](http://www.reddit.com/wiki/human_reddiquette) and remember the human.", 
            "Submissions and comments that are overtly political or attract too much political discussion will be removed; political topics are only acceptable if discussed in a historical context. Comments should discuss a historical topic, not advocate an agenda. \n This is entirely at the moderators' discretion and violators will be fed to the bear.", 
            "[Historical negationism](https://en.wikipedia.org/wiki/Historical_negationism).\n\nWe do not allow posts and comments about fringe hypotheses, false narratives, misunderstood or misrepresented history, genocide denial, and other disingenuous revisionism. They have proven to be magnets for those wanting to push a distortion of historic consensus and/or records. Engaging in historical negationism or denialism will result in a permanent ban.", 
            "One of the most heard complaints about large subreddits is the fact that the comment section has a considerable amount of jokes, puns and other off-topic comments. While this is perfectly fine for subreddits of a less serious nature, we do not think this is acceptable for /r/history. \n\nWe are a subreddit dedicated to knowledge about a certain subject with an emphasis on discussion. Therefore we think it is no more than reasonable to ask from subscribers to comment with that in mind.", 
            "Discussions about recent events will be removed. We want to focus on history itself and not provide history as a tool to make a point about the modern world. ", 
            "We strongly feel that if you find something interesting enough to share on /r/history it should be no problem to leave a short comment (50 or more words) about what you submitted. This may be anything from why you thought this is relevant for /r/history to what you found interesting about what you have submitted. This comment left by you can best be seen as a kickstarter for discussion.", 
            "Some content is better suited for other subreddits and might be directed there:\n\n- Images: /r/HistoryPorn (or put them in a text post and provide proper context)\n- Specific questions: /r/AskHistorians\n- Homework questions: /r/HomeworkHelp\n- Personal material: /r/HistoryBlogs\n- This day in history posts: /r/ThisDayInHistory\n- What if history: /r/HistoryWhatIf", 
            "- Spam; in /r/History we use the rule of thumb that if 10% or more of your *submissions on all of reddit* are your own content it is considered spamming. [Read our full guidelines about self promotion](https://www.reddit.com/r/history/wiki/selfpromotion)\n   - Post or ask to post links to Kickstarter or other fundraisers, charities or social media campains. \n   - Attempt to manipulate votes.\n   - Doxx (post personal information about people).\n   - Post illegal, rehosted or plagiarized content.", 
            "*Post from the original site.*  Submissions that are simply rehosted articles will be removed. ", 
            "When submitting a text post you should expand on the title in order to get the discussion started. This rule is similar to rule 6, and it might be even more important for text posts. A link has content to back it up, but in a text post you write the content.", 
            "*Titles of link submissions should accurately describe the content*, and not be sensationalized or misleading. Rule of thumb: for serious articles the original headline often is the best choice. When in doubt [message the mods](/message/compose?to=%2Fr%2Fhistory) before submitting your link.", 
            "Atrocities aren't an Olympic event, to be compared and scored according to how 'bad' they were. All mass killings, crimes against humanity, aggression, and repression are terrible, and while it is important to be able to contextualize the scope of a given event, boiling that scope down to a number to argue on a top-ten list or 'worst of' thread both denies the humanity of what happened and cheapens the severity of the crimes.", 
            "*This is an actively moderated subreddit, calls will be made at the moderator's discretion.*\n\nThis rule is not in here because we plan to completely arbitrary remove things. It's only here to leave no doubt about what is already implied on basically any online community. At times we might make calls to remove posts that strictly speaking might have fitted our rules (albeit barely) but are not in the spirit of the rules.", 
            "**[A full set of the /r/history rules is listed on our wiki](https://www.reddit.com/r/history/wiki/index#wiki_rules#viewmore)**. The list you are seeing is a reddit feature which is very limited and does not allow us to fit our full rules and guidelines."
        ]
    }, 
    "Futurology": {
        "popularity": 14158204, 
        "rules": [
            "Be respectful to others - this includes no hostility, racism, sexism, bigotry, etc.", 
            "Submissions must be futurology related or future focused. Note that political submissions are subject to stricter scrutiny under this rule.", 
            "Images and gifs require a starter comment. Memes, reaction gifs or similarly low effort content is prohibited.", 
            "No petitions, polls, surveys, fundraisers, crowdfunding, crowdsourcing, or otherwise soliciting the userbase. This is considered spam. ", 
            "Comments must be on topic, contribute to the discussion and be of sufficient length. Comments that dismiss well-established science without compelling evidence are a distraction to discussion of futurology and may be removed.", 
            "Account age: >1 day to comment, >5 days to submit content", 
            "Submissions and comments of accounts whose combined karma is too far in the negatives will be removed", 
            "Avoid posting content that is a duplicate of content posted within the last 7 days. ", 
            "Submissions with [in-depth] in the title have stricter post length and quality guidelines.", 
            "Titles should accurately and truthfully represent the content of the submission.", 
            "Support original sources - avoid blogs/websites that are primarily rehosted content.", 
            "Content older than 6 months must have [month, year] in the title."
        ]
    }, 
    "philosophy": {
        "popularity": 14130002, 
        "rules": [
            ">To learn more about what is and is not considered philosophy for the purposes of this subreddit, see our [FAQ](https://www.reddit.com/r/philosophy/wiki/faq). Posts must be about philosophy proper, rather than only tangentially connected to philosophy. Exceptions are made only for posts about philosophers with substantive content, e.g. news about the profession, interviews with philosophers.", 
            "> Posts must not only have a philosophical subject matter, but must also present this subject matter in a developed manner. At a minimum, this includes: stating the problem being addressed; stating the thesis; anticipating some objections to the stated thesis and giving responses to them. These are just the minimum requirements. Posts about well-trod issues (e.g. free will) require more development.", 
            ">/r/philosophy is intended for philosophical material and discussion. Please direct all questions to /r/askphilosophy.", 
            "\n>Post titles cannot consist only in questions, even if the title of the linked material is a question. This helps keep discussion in the comments on topic and relevant to the linked material. Post titles must describe the philosophical content of the posted material, cannot be unduly provocative or click-baity and cannot be in all caps.", 
            "> All links to either audio or video content require abstracts of the posted material, posted as a comment in the thread. Abstracts should make clear what the linked material is about and what its thesis is. Users are also strongly encouraged to post abstracts for other linked material. [See here](https://www.reddit.com/r/philosophy/wiki/abstracts) for an example of a suitable abstract.", 
            "> All posts must be in English. Links to Google Translated versions of posts are not allowed.", 
            ">Posts must not be behind any sort of paywall or registration wall. If the linked material requires signing up to view, even if the account is free, it is not allowed. Google Drive links and link shorteners are not allowed.", 
            "The following (not exhaustive) list of items require moderator pre-approval: meta-posts, posts to products, services or surveys, links to other areas of reddit, AMAs. Please contact the moderators for pre-approval via [modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fphilosophy)", 
            "Users must follow all reddit-wide spam guidelines, and in addition must not submit more than one post per day on /r/philosophy.", 
            "> Discussion of suicide is only allowed in the abstract here. If you or a friend is feeling suicidal please visit /r/suicidewatch.\nIf you are feeling suicidal, please get help by visiting /r/suicidewatch or using other resources. See also our discussion of philosophy and mental health issues [here](https://www.reddit.com/r/philosophy/wiki/mentalhealth). Encouraging other users to commit suicide, even in the abstract, is strictly forbidden.", 
            ">Read the posted content, understand and identify the philosophical arguments given, and respond to these substantively. If you have unrelated thoughts or don't wish to read the content, please post your own thread or simply refrain from commenting. Comments which are clearly not in direct response to the posted content may be removed.", 
            ">Opinions are not valuable here, arguments are! Comments that solely express musings, opinions, beliefs, or assertions without argument may be removed.", 
            ">Comments which blatantly do not contribute to the discussion may be removed, particularly if they consist of personal attacks. Users with a history of such comments may be banned. Slurs, racism, and bigotry are absolutely not permitted."
        ]
    }, 
    "OldSchoolCool": {
        "popularity": 14062844, 
        "rules": [
            "Everything from 1993 and after will be removed.\n", 
            "Submissions without a year in the title will be removed. If you don’t know the exact year, make an educated guess and put the decade.\n", 
            "Offensive comments include whether or not you would have sex with OP’s mother, ranking attractiveness, and sexualized commentary about various body parts and underage people. Nobody cares about your sexual impulses, least of all the OP.\n\nIt is up to moderators to decide whether a comment is offensive enough to warrant a ban. However, here is a good rule of thumb to follow: If you wouldn’t say it about your own mother, don’t say it here.\n", 
            "It is okay to submit photos of deceased relatives. It is not okay to mention that they have passed away in the title. Please include this information in a comment if you feel the need to share.\n", 
            "If you are unsure whether you are about to submit a repost, check beforehand using karmadecay.\n", 
            "This should be self-explanatory. No vehicles, buildings, animals, etc.\n"
        ]
    }, 
    "WritingPrompts": {
        "popularity": 13956252, 
        "rules": [
            "* 100 words minimum for stories, 30 for poems but include [Poem]\n* Newly written by you for the prompt\n* Plagiarism will result in a ban\n* No joke responses / copypasta\n* For off topic/clarification, reply to the sticky comment", 
            "* No explicit sexual responses / erotica\n* Includes, but is not limited to, forms of pedophilia, bestiality, incest, rape, violence against children, and explicit torture\n* Avoid racism and detailed uses of suicide and political debate\n* Use your best judgment, but mods have final say", 
            "* Users are held to a higher standard here. Think before posting\n* We are here to encourage writing\n* Understand that people here are at all different levels:\n * New writers\n * Experienced writers\n * Professional writers\n * Users who are just learning English\n* Typos and grammatical errors are possible.  Be nice if you point it out\n* Feedback and critiques are encouraged, but just saying something's bad is not helpful at all and will be considered trolling", 
            "All submissions must start with *one* capitalized **tag** in **square brackets**:\n\n* [WP] - **Writing Prompt**\n* [SP] - **Simple Prompt**\n* [EU] - **Established Universe**\n* [CW] - **Constrained Writing**\n* [TT]  - **Theme Thursday**\n* [MP] - **Media Prompt**\n* [IP] - **Image Prompt**\n* [RF] - **Reality Fiction**\n* [PM] - **Prompt Me**\n* [PI] - **Prompt Inspired**\n* [CC] - **Constructive Criticism**\n* [OT] - **Off Topic**\n\n[**More >>**](/r/WritingPrompts/wiki/how_to_tag_prompts)", 
            "* Search before submitting! (Popular ideas can cause floods)\n* Reposts are allowed, given time (around two weeks)\n* Don't take a recent prompt and change/invert small details", 
            "* Prompt in the title and only use text for commentary or links for [IP]s and [MP]s.  Avoid [too many details](http://goo.gl/6v3rGd)\n* No requesting writing or editing services, or homework help\n* Don't post ads without getting permission in modmail first\n* Don't ask writers to pick titles or content from another sub or site\n* Prompts should not call for using autocorrect, autocomplete, or only emojis", 
            "* Avoid real world drama (including politics, recent tragedies)\n* Inspire an effort, avoid simple questions, \"write anything\", or fill-in-the-blanks\n* Don't ask for preexisting content (prompts are meant for new writing)\n* No explicitly sexual themes, hate speech, or other harmful content (including hate speech, racism, politics, necrophila, pedophila, bestiality, incest, torture, rape, violence against children, and suicide)\n* No troll, poop, or meme-based prompts", 
            "* Wait until prompt is 24 hours old before linking from other subs to avoid vote manipulation and/or brigading (Text posts OK with no link and links *from* a story *to* another sub are fine)\n* Don't spam the subreddit with links to crowdfunding sites like Patreon and Paypal.  Authors are free to link to those from their personal subreddits\n* Any recording or use of other people's stories must follow the [guidance in the FAQ](https://www.reddit.com/r/WritingPrompts/wiki/faq)"
        ]
    }, 
    "personalfinance": {
        "popularity": 13910139, 
        "rules": [
            "#Please treat others with respect, stay on-topic, and avoid self-promotion.\n\nPosts must be a personal finance question or discussion with a descriptive title and not:\n\n* Non-English\n* Generic, hypothetical, improbable, or AskReddit-style questions\n* Surveys or polls\n* Success stories and thanks (use the weekday/weekend thread)\n* Meta posts\n* IAMA/AMA requests or posts\n* News or information without a discussion, quote, or summary\n\n#[Additional Rules and Best Practices](/r/personalfinance/w/rules)", 
            "We don't allow:\n\n* Promotion of web content, products, services, companies, or anything else owned by you (or anyone affiliated with you), even if not monetized\n* Accounts with promotional profiles or usernames\n* Offering referral, invite, or affiliate links/codes\n* Soliciting business/investors, market research, media requests, or recruiting\n* Repeatedly or prominently stating finance-related credentials\n* PM requests or offers\n\nRequires pre-approval: open source tools, customer service replies", 
            "We don't allow:\n\n* Circlejerking or karmawhoring\n* Posting purely for upvotes or humor\n* Insincerity or dishonesty\n* Trolling, loaded questions, loaded language, or provoking unproductive conversation\n* Memes and low-effort content\n* Clickbait titles\n* Excessive large, bold, or spaced-out text\n* Bots and bot summoning\n* Novelty accounts that post \"in character\"\n* Insubstantive or ephemeral posts\n* Requesting votes/fewer votes\n* Excessive profanity\n* [Poor reddiquette](/w/reddiquette)", 
            "We don't allow asking for handouts or transactions.  That includes:\n\n* Asking (even indirectly) for gifts, loans, or donations for yourself or on behalf of any organization or person(s)\n* Any mention of a fundraising campaign even without a link\n* Requesting a job\n* Asking for loan cosigners\n* Soliciting for anyone to engage in any kind of transaction", 
            "We don't allow legal or business discussions. That includes:\n\n- Discussions that are predominantly legal issues\n- Discussions about starting, funding, or running a business, corporation, partnership, etc.\n- Content better suited for /r/legaladvice, /r/smallbusiness, /r/entrepreneur, or /r/business.", 
            "We don't allow:\n\n- Moralizing issues\n- Petitions or calls-to-action\n- Political discussions\n- Political baiting\n- Soapboxing\n", 
            "We don't allow:\n\n* Suggesting another user perform illegal activity (or an activity that is illegal in most jurisdictions)\n* Linking to illegal content or lawbreaking information\n* Asking for advice on how to commit fraud, evade taxes, etc.\n* Suggesting the use of piracy, warez, software cracks", 
            "We don't allow:\n\n* Personal attacks\n * Raw criticism without any constructive feedback\n * Name-calling, flaming, shaming, or otherwise harassing another poster (or person being helped)\n * Telling a user to harm themselves or others\n* Abusive language\n * Intentionally rude or very harsh language\n * [Hate speech](/r/personalfinance/wiki/rules#wiki_definitions)\n * Suggesting [sex work](/r/personalfinance/wiki/rules#wiki_definitions) (even indirectly)\n * Retaliating in response to an affront", 
            "We don't allow relationship or personal advice discussions. That includes:\n\n* Content better suited for /r/relationships\n* Recommending a poster end their current relationship or start a new relationship\n* Posts about suicide or violence\n* Posts asking for advice on how to convince someone else to change their behavior\n* Relationship drama not essential to a question or discussion\n* Family planning advice, especially unsolicited or flippant\n* Job or school selection questions\n* Medical advice", 
            "* Missing－Disappearing after posting a discussion, posting for another with inadequate information\n* Hyping－Pushing speculative, volatile, illiquid, or meme investments, especially flippantly, tersely, or implying huge returns\n* Rabble rousing－We're not your personal army\n* Doxing－Posting or seeking personal information, dox attempts or threats\n* Flooding－Posting excessively frequently\n* Duplicates－Reposting news or information\n* Plagiarism－Not giving credit properly"
        ]
    }, 
    "nosleep": {
        "popularity": 13459110, 
        "rules": [
            "Your post must be a story. This means it has to have a plot - something must happen, and then something else must happen as a result. \n\n\nAll NoSleep posts must be horror. [Click here for more information on this rule.](https://www.reddit.com/r/nosleep/wiki/horror)\n\n\nThe inclusion of horrible events does not necessarily make a story horror.  [Click here for more information on this rule.](https://www.reddit.com/r/nosleep/wiki/horriblenothorror)", 
            "This means that the narrator must be physically and mentally capable of posting and that the events of the story cannot be proven to be false on a large scale. Stories posted in 2nd person or third person omniscient must have a clearly stated believable reason for being written as such. [Click here for more information on this rule.](https://www.reddit.com/r/nosleep/wiki/believability)", 
            "If you have more than one story to tell in your post, each one should be connected by a central plot element (i.e. each story happened in the same house or to the main character while working a certain job) and be a complete story. If you simply list unrelated events without a connection or narrative, your post will be removed. [Click here for more information on this rule.](https://www.reddit.com/r/nosleep/wiki/multiplestories)", 
            "Only post your own original work. Do not post creepypasta or links to scary stories/photos/videos you found online. You may include your own photos and videos as a supplement your story, however, the story cannot rely on these elements.\n\n\nNo piggybacking, \"fan fiction\", or bandwagon posts. You may not use another author's intellectual property when posting on this subreddit.", 
            "No tl;dr titles or titles which impersonate another subreddit. The only thing in parentheses or brackets should be the part number of a series.\n\nAll series must be marked as such using the \"series\" flair. Graphic content must be marked with Trigger Warning/NSFW tags and any appropriate flair. This serves as a “trigger warning,” which is there to note certain types of upsetting content.\n", 
            "Series updates must be at least 1000 words and all parts of a series must follow all of r/nosleep's posting guidelines. In particular, each part must have meaningful plot/character progression and meaningful horror content. It cannot be merely an introductory post or filler.\n\n\nYour series posts should include a link to previous entries and the following entry, if applicable and be marked with a \"Series\" flair.", 
            "Due to limited space, not all of our rules are listed here. In order to ensure that your post does not get removed, be sure to thoroughly read our [complete list of posting guidelines](http://www.reddit.com/r/nosleep/wiki/posting_guidelines).", 
            "Users are to act as though everything is true on r/nosleep and treat it as such in posts and  comments.\n\n\nNo debunking, disbelief, or criticism (constructive or otherwise). If the formatting is off, report the post and mods will address it.\n\n\nDo not ask for proof or tl;dr's.", 
            "This means no joke comments. It also means your comment should have or make a point."
        ]
    }, 
    "creepy": {
        "popularity": 13216721, 
        "rules": [
            "All posts must be creepy. Reposts less than a year old will not be allowed.", 
            "No pictures of costumes, makeup, or supposedly creepy children's art without approval from the moderation team. As these things can be hard to judge objectively, it is preferred to leave them out of the subreddit without prior expressed approval. In addition, please refrain from posting ads or advert-like posts without express moderation staff approval."
        ]
    }, 
    "TwoXChromosomes": {
        "popularity": 12473513, 
        "rules": [
            "No hatred, bigotry, assholery, misogyny, misandry, transphobia, homophobia, racism or otherwise disrespectful commentary. Please follow reddiquette.", 
            "No drama-inducing crossposting of content found in other subreddits. Likewise, posts found to direct odious influxes here will be removed. Advertising your fabulous new subreddit is always welcome here.\n\nYou are welcome to link to relevant subreddits when warranted, but linking to comment threads is almost always considered drama-inducing regardless of intent. \n\nRelevant AMAs can be linked to. In subreddits smaller than 500k subscribers AMA's must be posted by a moderator of that subreddit. ", 
            "No tactless posts generalizing gender. We are a welcoming community. Rights of all genders are supported here.", 
            "We ask that you keep this community awesome by submitting content that is relevant to our experiences as women, for women, or about women. \n\nSeveral topics are not considered relevant, such as: Medical Advice; Relationship repair and advice; Surveys, Research and Petitions; Rage comics, memes, etc; Horrible things said and done by individuals; Fundraising posts; Issues affecting men too; Questions for the perspectives of women; Posts made to debate the women of reddit; images outside of IFF."
        ]
    }, 
    "technology": {
        "popularity": 8153648, 
        "rules": [
            "Submissions must be primarily news and developments relating to technology.\n\nSelf posts must contribute positively to /r/technology and foster reasonable discussion. Cross-post self posts are not acceptable. \n\nSubmissions relating to business and politics must be sufficiently within the context of technology in that they either view the events from a technological standpoint or analyse the  repercussions in thetechnological world.\n", 
            "Articles with supporting image and video content are allowed; if the text is only there to explain the media, then it is not suitable. A good rule of thumb is to look at the URL; if it's a video hosting site, or mentions video in the URL, it's not suitable.", 
            "Submissions **must** use either the articles title and optionally a subtitle, or, ***only***  if neither are accurate, a suitable quote,  which must:\n\n* adequately describe the content\n* adequately describe the content's relation to technology\n* be free of user editorialization or alteration of meaning.", 
            "Requests for tech support, asking questions or asking for help: submit to /r/techsupport, /r/AskTechnology, another relevant community or our weekly [Support Saturday threads.](https://www.reddit.com/r/technology/search?q=flair%3ATechSupport%26sort%3Dnew%26author%3AAutoModerator%7Cveritanuda&restrict_sr=on&sort=new&t=all)", 
            "Please do not submit any petitions, surveys, crowdfunding, or any other call to action or fundraising.", 
            "Submissions discussing the subreddit itself; they should be submitted to /r/TechnologyTalk, or [messaged to the moderators of the subreddit](https://www.reddit.com/message/compose?to=%2Fr%2Ftechnology&subject=I actually read the rules!).", 
            "Please do not submit discussions of one or more incidents of customer support or customer feedback.", 
            "You are advised to abide by [reddiquette](https://www.reddit.com/wiki/reddiquette); it will be enforced when user behavior is no longer deemed to be suitable for a technology forum. Remember; personal attacks, directed abusive language, trolling or bigotry in any form, are therefore not allowed and will be removed.", 
            "Reddit admins in the infinite wisdom has made the creation, formatting and editing of these sidebar rules for the redesign so painfully complicated we cannot devote time to trying to maintain two template. Please visit the above link for a definitive definition of the rules as they are mean to be applied to this sub. Please make any frustration you may have at this known to the admins.   "
        ]
    }, 
    "AdviceAnimals": {
        "popularity": 7720186, 
        "rules": [
            "Correct format is,\n\nTwo line joke over a re-usable character.", 
            "**Don't post stuff you found from elsewhere on the web, it's probably been here already.**\n\nThis subreddit is for original content only, meaning memes YOU made. \n\nDo not resubmit your post later for more karma. \n\nReposting is a bannable offense.\n\nIf you see a repost please report it as such, and [send a quick note to the mods](https://www.reddit.com/message/compose?to=%2Fr%2FAdviceAnimals) if you can.", 
            "Cake Day posts are not allowed.\n\nPosts that mention Cake Day in the title, or in the post itself will be removed.", 
            "Verticals are multiple panel memes or image macros and both are better suited for either /r/funny or /r/vertical.\n\nCombining 2 established memes together such as [Socially Awkward Penguin](http://knowyourmeme.com/memes/socially-awkward-penguin) and [Socially Awesome Penguin](http://knowyourmeme.com/memes/socially-awesome-penguin) is fine.\n\n[This is unpopular opinion puffin](http://i.imgur.com/qs4z4Rm.jpg)\n\n[This is an example of a Batman Slap](https://i.imgur.com/5rrb52F.jpg)", 
            "Don't make memes with pics of people that you saw in real life. Ever.\n\nDon't try to make yourself or someone you know into a meme.\n\nAlso, we do not allow witch hunts on the subreddit.", 
            "**Death threats and telling others to kill themselves will result in a ban.**", 
            "We're here to have a laugh, hate speech, bigotry, and personal attacks are not allowed."
        ]
    }, 
    "Fitness": {
        "popularity": 7479979, 
        "rules": [
            "https://www.reddit.com/r/Fitness/wiki/rules"
        ]
    }, 
    "memes": {
        "popularity": 6327743, 
        "rules": [
            "* All posts must be memes and follow a general meme setup.\n\n* No titles as meme captions.\n\n* No unedited webcomics\n\n* **No memes that are text only.**\n\n* Pictures without captions may be removed by a moderators discretion.\n\n* **Someone saying something funny on twitter/tumblr/reddit/etc. is not a meme.**", 
            "* Please make posts general rather than specific personal experiences. This helps make posts more relatable.\n\n* No selfies, SMS screenshots, personal stories, chats, emails, etc.\n\n* **Do not post \"memes\" of you or your friends IRL.**\n\n* No creepshots", 
            "* Do not spam this sub. Linking to your social media, or spamming links with it watermarked can result in a ban\n\n* No 'split' or 'linked' posts - either between yourself or other users.\n\n* No Chainposting\n\n* Images of being banned or having a post removed from any subreddit will be removed and subject to ban\n\n* 5 or less posts per day please. \n\n* Mark NSFW posts as such or it risks being removed. \n\n* No watermarks or shilling your favourite YouTube star\n\n* No spam bots", 
            "* Please do not troll, harass, or be generally rude to your fellow users.\n\n* Do not post raid messages or encourage others to flood or spam another subreddit or website.\n\n* Keep comments civil and be respectful of your fellow users. \n\n* Don't post racist or bigoted memes. Those belong elsewhere.\n\n* **Racist and bigoted memes, harassment, and raiding other subreddits/sites can lead to a permanent ban at the moderators discretion.**", 
            "* Please do not post or request personal information, yours or others.\n\n* All posts containing social media IDs/usernames will be removed.\n\n* Do not post images with watermarks to other sites users.", 
            "* Please link to images directly. Direct links make browsing easier for those using RES or through a mobile device.\n\n* No videos/GIFs.", 
            "* **Please** **do not mention** **upvotes/downvotes/cake days/karma/awards (gold/silver/plat) in your post in any form.**\n\n* No images of upvote arrows, awards or screenshots of your karma.\n\n* **No \"Upvote in...\" or \"Downvote if...\"** type titles or memes.\n\n* **No memes about votes, likes etc.**\n\n* This includes (but is not limited to) karma-adjacent words/phrases like \"front page\" or \"sort by new\".\n\n* Begging for karma in the comments may earn you a lengthy (perhaps infinite) ban.", 
            "* Please avoid re-posting memes. \n\n* We want original content. Serial reposters may be banned.\n\n* Seriously.", 
            "* No forced memes, overused memes, bad titles, or pushing agendas\n\n* Be creative but memes must come naturally\n\n* Memes that have been overused/played out to the point of being spammy will be removed. [**Examples**](https://www.reddit.com/r/memes/wiki/overused)\n\n* No petitions", 
            "* No memes about violent tragedies or anything that could be seen as glorifying violence.\n\n* **Absolutely no school shooter memes.**\n\n* Posts or comments that can be seen as glorifying violence will result in a ban. This also includes (but is not limited to) memes regarding: Deaths, terrorist attacks, rape, sexual assault, pedo, murder, war, bombings, and school shootings. \n\n* Breaking this rule may result in a permanent ban. \n\n* We have zero tolerance for this behavior.", 
            "* Absurd memes featuring politicians are allowed, but this sub does not allow content more suited for /r/politicalhumor.\n\n* No NPC memes, or memes about how libtards or magats are so wrong. Take it somewhere else, thanks."
        ]
    }, 
    "WTF": {
        "popularity": 5854924, 
        "rules": [
            "**No screenshots of anything! 7 day ban for violation.**\n\nExamples: Text messages, web pages, apps, Snapchat, Instagram, Facebook, YouTube, or any other social media or web pages. This includes pictures or videos of cellphone screens, tablet screens, computer screens and TV/monitor screens. \n\nDoesn't matter who created it or how, don't post it here. ", 
            "All personal information will be removed, offenders banned. This includes, but is not limited to, full names, phone/address & online profiles", 
            "This includes posts which may incite activism, outcry, outrage or involve \"injustice\". Also, Reddit is not your personal army.", 
            "Neither posts with political implications, nor politics of any kind are allowed, especially US politics.", 
            "NSFW posts must be tagged as such. NSFW comments in SFW posts need to be mentioned as such.", 
            "This includes Captioned Images, Memes, & Demotivational Posters.", 
            "No comics, cartoons, animation, CGI, photoshopped images or tattoos. This includes rage comics, print comics, web comics, animation videos/gifs & Manga. Let's keep things real.\n", 
            "No posts or comments soliciting karma or votes.\n\nIncludes posts about cakeday.", 
            "Links to reddit posts are not allowed", 
            "Gore is not allowed: All forms of gore, which includes depiction of serious physical injury involving blood, flesh, bone and internal organs.", 
            "To make this a welcome sub for all, your unwelcome comments will not be tolerated, and you will be banned. Examples: Negative comments towards race, ethnicity or religion, direct or implied, true or false facts. Race baiting or slurs, making comments to get a toxic thread going, or jumping in on that bandwagon. Telling someone to kill themself. If you have anger management issues or low tolerance for other people that you feel are less equal to you - then stay out of this sub.", 
            "No novelty accounts or bots. They will be banned. (Please report them)"
        ]
    }, 
    "politics": {
        "popularity": 5415684, 
        "rules": [
            "[Full on-topic statement here](https://goo.gl/snBrXT).\n\nAll submissions to /r/politics need to be explicitly about current US politics. The content must directly discuss politics.\n\nSubmissions should focus on one of: \n\n* Information and opinions concerning the running of US governments, courts, public services and policy-making.\n\n* Private political actions and stories such as demonstrations, lobbying, candidacies and funding and political movements, groups and donors.\n\nNo satire or meta posts.", 
            "All submissions to /r/politics must be published within the last calendar month.", 
            "[Full rule here](https://goo.gl/GT8BAS).\n\nA title must be comprised only of the copied and pasted headline of the article.\n\nDo not add, remove, or change words. \n", 
            "[Full rule here](https://www.reddit.com/r/politics/wiki/index#wiki_no_copy-pasted_articles).\n\nPlease do not submit articles or videos that are a direct, complete copy-paste of original reporting. Articles or videos that add another take on a subject, or include different verbiage or context are allowed.\n\n", 
            "[Full rule here](https://goo.gl/dgUagk).\n\nIf a link returns a 404 error, please report it and let us know.", 
            "Articles that require users to take a survey, or to enter any information in order to view material, or to become a paid subscriber are not allowed.", 
            "[Our full civility rule is here](https://goo.gl/prtXLT).\n\nBe civil and constructive at all times. Attack ideas, not users. \n\nPersonal attacks are not permitted. This includes calling a user a shill/troll, or any other attack. [This is a broad rule](https://goo.gl/VAafl4).\n\nHate speech is not permitted.\n\nFlaming and baiting is not permitted. Don't try to bait people into uncivil behavior. If you think you are the victim of flaming or baiting, report the behavior instead of responding. ", 
            "Please only report a user as a troll if it is an actual troll, rather than simply someone with whom you disagree. ", 
            "Polls and petitions are not allowed here. This rule is applied to, but not limited to, any link or text post that is attempting to solicit money, signatures, poll responses, volunteer hours, or sign ups from users. \n\n\"Solicitation\" can include advertising a subreddit. \n\nArticles about polls or petitions are allowed as long as they are newsworthy.\n\nAdvertisements as submissions are not permitted.", 
            "No racist or sexist speech. Also no abusive speech based on religion, sex/gender, or sexual orientation.", 
            "Please make sure that you allow at least 10 minutes to pass between each submission, and submit no more than 5 articles within a 24 hour period.  Deleted posts are included in this rule. Moderator removed posts are not.\n\n"
        ]
    }, 
    "wholesomememes": {
        "popularity": 5355164, 
        "rules": [
            "All posts must be wholesome memes: uplifting, life-affirming, or nice-ing up a rude meme. ", 
            "Memes should be relatable, with universally uplifting themes. Avoid posts that promote an ideology, religion, or brand over others, & posts that show individuals' politeness without some universal theme.", 
            "Please avoid submitting NSFW content.  PG-13 is fine, but please tag those \"NSFW\" for young or sensitive users.", 
            "Please do not troll, harass, or be generally rude to your fellow users. Keep comments civil and be respectful of your fellow users. \nBe nice. This is a happy place.\nNo proselytizing. Keep your religion, your politics, your diet, and any other crusade you might carry to yourself. We come here to get away from arguing and politics and the like, so please respect that by keeping your agendas to yourself.", 
            "Please do not post personal info, yours or others. All names should be blocked out, except public figures. Also, private communication & private posts are private; please don't post them here.", 
            "Please link to images directly. This makes browsing easier for those using RES or through a mobile device", 
            "Please do not submit low effort memes or mention upvotes in your post.\n\nThis includes \"Let's get this to the front page!\" type posts, \"You have been visited by\", \"people who sort by new\", \"stop scrolling\", or posts about reddit karma.\nLow effort memes include: Skyrim \"Wholesome 100\", \"You're Breathtaking\", Thanos \"That does put a smile on my face\", [happiness noises], Fallout [Everybody liked that], and \"Because that's what heroes do\". This isn't an exhaustive list, but I think you get the idea!", 
            "Avoid posting memes that have already been posted to *this* sub.  Fresh content is vital.  \nWe *may* allow a repost at our discretion, if it has not already been a frontpage post, and if it has been over 6 months since it was last posted here.  \nDo not spam or post more than 3 memes in a 24 hour period.", 
            "Set your post up for success.  \"Does this fit here?\" helps nobody. Being funny or descriptive helps.  And trying is good.", 
            "Be nice to turtles pls", 
            "Please keep your post related to the human experience.  Try r/rarepuppers  or r/aww"
        ]
    }, 
    "bestof": {
        "popularity": 5125231, 
        "rules": [
            "Everyday interaction with celebrities may not be suitable for /r/bestof.", 
            "Submissions about bots doing their thing, or novelty accounts doing theirs are not welcome here. Comments from bots and novelty accounts are similarly not welcome. ", 
            "Do not link to your own comments or self posts please.", 
            "Sometimes comments need to be linked with context", 
            "If you're planning on reporting a post because you don't like it, please use this as your report reason so we know to ignore you.", 
            "Civility is required of commentators in /r/bestof. If you're unable to refrain from insulting others in your responses, then your responses, and possibly you, will be removed from the subreddit.", 
            "If the linked comment has been removed, or if the submission is a duplicate of a recent post, please report it so we can confirm and remove.", 
            "Do not post comments saying posts do not belong here without backing up your claims. You are more than welcome to point out inconsistencies or express your skepticism, but saying things like 'ban this sub', or 'this isn't bestof', and the like do not contribute to the sub and create a toxic atmosphere."
        ]
    }, 
    "interestingasfuck": {
        "popularity": 4272661, 
        "rules": [
            "Make sure your post is actually interesting as fuck. This is not the place for fails, trashiness, funny content, posts that are purely text, etc.", 
            "If your post declares something as fact, please cite a source in it, or in the comment section.", 
            "We are here to learn and share interesting things. Don't be a jerk.", 
            "This isn't the place for gossip or things you're going to find on magazines in the grocery store check out isle. This includes screenshots from social media. ", 
            "Don't be a spammer", 
            "Make sure your title is descriptive. Users should be able to know what the post is generally about or if it's a pun they should get the joke after viewing the content of the post. If needed you can add additional information in the comment section.", 
            "This is only for reposts that have been posted to /r/interestingasfuck recently or have been posted so often that the majority of users have seen this content (Give it a bit and find something new to post)"
        ]
    }, 
    "BlackPeopleTwitter": {
        "popularity": 3595696, 
        "rules": [
            "This sub is intended for exceptionally hilarious and insightful social media posts made by black people. To that end, **only post social media content from black people**.\n\n**Do not post content just because a black person posted it.** \n\n* No low effort/shit posts.\n\n* No original content\n\n* No posts from meme/corporate accounts \n\n**Violation of this rule will result in your post being removed and repeated offenses may lead to you being banned.**", 
            "Only post or comment in good faith. We do not tolerate [bad faith participation](https://www.reddit.com/r/BlackPeopleTwitter/comments/8ezy45/an_update_for_some_of_the_rules_bad_faith/).\n\n", 
            "* No bullying or witch-hunting. This includes comments disparaging people whose tweets and posts are featured here.\n\n* No revealing of personal information (doxxing). \n\n* Don't call out people as white. People of all colors do post and comment here.\n", 
            "There will be zero tolerance for racism, homophobia/transphobia, or sexism/misogyny, engaging in any sort of hate speech will result in the post or comment being removed and the poster being banned. **We do not allow hate speech.**", 
            "**Posts must be showcasing somebody being hilarious or insightful on social media**. No image macros, text conversations, or YouTube links. Just because somebody posted one of these on social media does not exempt it from this rule. Vines and such belong [here](http://www.reddit.com/r/BlackPeopleVines/) and gifs belong [here](http://www.reddit.com/r/blackpeoplegifs).\n\n**DO NOT** link directly to someone's post on the platform. Your post will be removed", 
            "Typical Reddit cliches such as **lyric chains**, **pun chains**, white-knighting, and low-effort joke comments will be removed. Same for [annoying redditisms](https://www.reddit.com/r/BlackPeopleTwitter/comments/8ezy45/an_update_for_some_of_the_rules_bad_faith/dxzhp13/), such as linking a subreddit as a reply to a post/comment.\n", 
            "Reposts are highly discouraged, and if discovered will be removed. Please search or look through BPT's older posts to see if your content has already been posted. KarmaDecay is not a reliable tool to check for reposts.\n\n**Violation of this rule will result in your post being removed and repeated offenses may lead to you being banned.**", 
            "No posts with terrible titles, they will be removed. You are free to re-submit once you think of something acceptable/reasonable. **Don't put the punchline in the title of the post.** Do not add \"bruh\", \"fam\", or similar vernacular to your post or comment.", 
            "Do not complain about the use of [AAVE](https://en.wikipedia.org/wiki/African-American_Vernacular_English) and/or slang. Use [Urban Dictionary](http://www.urbandictionary.com) if you do not understand the meaning of a word. Comments asking \"what does x mean?\" will be removed, same with comments criticizing the dialect.", 
            "The moderators may take any action (which includes banning users or removing comments) that they feel improves the quality of the subreddit.\n"
        ]
    }, 
    "oddlysatisfying": {
        "popularity": 3450980, 
        "rules": [
            "Number post, compilation video, or other topic mentioned in rule 1.", 
            "NSFW/NSFL content", 
            "Repost of last 2 months or top 100\n\nPlease use \"other\" and include link to original post", 
            "Submission title doesn't represent the content", 
            "OP claimed content as their own", 
            "Spam account/suspicious link", 
            "OP doesn't have good behaviour here"
        ]
    }, 
    "leagueoflegends": {
        "popularity": 3362338, 
        "rules": [
            "[Full description](https://www.reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_must_be_directly_related_to_league_of_legends)", 
            "[Full description](https://reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_no_personal_attacks)", 
            "[Full description](https://www.reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_don.27t_address_individuals)", 
            "[Full description](https://reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_don.27t_share_how_to_cheat)", 
            "[Full description](hhttps://www.reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_specific_content_restrictions)", 
            "[Full description](https://reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_titles_require_context)", 
            "[Full description](https://reddit.com/r/leagueoflegends/wiki/subredditrules#wiki_edits_must_be_about_the_topic)"
        ]
    }, 
    "travel": {
        "popularity": 3267723, 
        "rules": [
            "[Read the FAQ and search before posting.](http://www.reddit.com/r/travel/wiki/index). \nSearch the subreddit to see if topics have been covered already", 
            "[Include a descriptive title.](https://www.reddit.com/r/travel/wiki/submission-guidelines#wiki_use_descriptive_titles) One or two word titles rarely provide enough information. Include the destination / area. When posting images: inspire us. Be original and provide travel context.", 
            "Clickbait, spam, memes, ads, brochures, surveys, vlogs, blogs or other [self-promotion](http://www.reddit.com/wiki/selfpromotion) will be removed.", 
            "Be as specific as possible: where you're starting, dates of travel, budget, interests, places you've been, things you like and dislike.\n\n**Visa and passport questions: state your country of citizenship.**", 
            "Present the research you've already done so we don't feel like we're doing everything for you; we are not your travel agents.", 
            "Check to see if your question can be answered with a quick Google search. Similarly, call the airline, hotel, embassy, or other direct source to see if they have your answer; many things are better off  (or only) answered directly from the source.", 
            "Stay around to answer questions or respond to comments. This applies to all posts.", 
            "Questions need to be as [specific as possible](https://www.reddit.com/r/travel/wiki/submission-guidelines#wiki_give_specifics), including: where you're starting, dates of travel, budget, interests, places you've been, things you like and dislike.\n\nPosts should also include the research already conducted - [Google](https://www.google.com/) and the crowdsourced [/r/travel FAQ](https://www.reddit.com/r/travel/wiki/index) are great places to start. We are not your travel agents.", 
            "Keep it civil: no racism, negative stereotyping or politics.", 
            "While simple posts or links to gear or sites does not necessarily constitute advertising, avoid posting just for promotional or marketing purposes."
        ]
    }, 
    "facepalm": {
        "popularity": 2912008, 
        "rules": [
            "Do not post personal information and censor any PI, including usernames, when posting. ", 
            "Don't post memes or image macros.", 
            "Do not post obvious jokes or satire. ", 
            "Don't post facepalms related to grammar or spelling errors.", 
            "Don't repost."
        ]
    }, 
    "pcmasterrace": {
        "popularity": 2907928, 
        "rules": [
            "Harassment of others is strictly forbidden. We will not tolerate any kind of incitement to action against anyone, nor will we allow the posting of information that can be used to harm others (celebrities or not).", 
            "We will not allow behavior contrary to [PCMR Etiquette](/r/pcmasterrace/wiki/etiquette), e.g. brigading, witch-hunting, asking for upvotes or downvotes, enabling piracy, flamebaiting, clickbaiting, text spamming or intentional rudeness.", 
            "Don't link to threads in other subreddits. This includes NP links and archived links. Do not attempt to circumvent this rule by any means.", 
            "Screenshots of Reddit, Facebook, Youtube, and other site's comments should have the usernames blacked out (including yours). Celebrities are the exception, as long as you respect rule #1.", 
            "No referral or affiliate links/codes.", 
            "Not only should all content be relevant to what is usually discussed here on its own but also unrelated content, blatant reposts/fad-chasing, concern trolling, low quality or or low-effort content (including, but not limited to, simple website or software bugs) will be removed. Reaction images are not allowed as submissions unless very high effort or especially original. This rule is to be enforced at moderator discretion.", 
            "Age, nationality, race, gender, sexuality, religion, political affiliation and economic status are all irrelevant here. All are welcome in the PC Master Race. Also, linking the PC Master Race with racial supremacy or any kind of fascist ideologies, or making distasteful analogies in this regard, is not acceptable in the slightest.", 
            "No begging. No [soft begging](https://goo.gl/4J9rq6). No Implicit or explicit trading. No buying. No Selling. No asking for valuation. No asking how or where to do these either.", 
            "Message the mods first, and wait for permission, if your post/comment is NSFW. Do not mark your post as NSFW or as Spoiler unless it actually is NSFW or a Spoiler.", 
            "Screenshots of \"peasantry,\" including but not limited to conversations on Reddit, other websites or sms/chat screenshots where ignorance is being spewed and/or ridiculed, must be text posts."
        ]
    }, 
    "dankmemes": {
        "popularity": 2816278, 
        "rules": [
            "Does not follow reddit [content policy](https://www.reddit.com/help/contentpolicy/) and/or [reddiquette](https://www.reddit.com/wiki/reddiquette). This includes (but is not limited to) memes regarding deaths, terrorist attacks, rape, sexual assault, pedo, murder, war, bombings, and school shootings.", 
            "There is a difference between comedy and outright hate speech, but ironic hate speech is still hate speech. Breaking this rule may result in a permanent ban.", 
            "Don't be a dick! This includes spoilers, don't post spoilers or you will be banned", 
            "No memes about violent tragedies or anything that could be seen as glorifying violence. Absolutely no school shooter memes. Posts or comments that can be seen as glorifying violence will result in a ban. This also includes memes regarding: Deaths, terrorist attacks, rape, sexual assault, pedo (including uncle), murder, war, bombings, and school shootings. Breaking this rule may result in a permanent ban.", 
            "Censor any and all personal information from posts and comments, or it will be removed. Real or fake! Yours or others! Just don't do it. This includes non-verified twitter handles, reddit usernames that aren't watermarks, and all other social media!", 
            "r/dankmemes is strictly for memes. Post videos (or anything using v.redd.it) to r/dankvideos. This is not a platform to advertise your social media network or subreddit. If you can't grow it organically, it probably isn't very good anyway. Linking to your instagram or twitter, or spamming links with it watermarked can result in a ban\n\nNo queue flooding - Limit yourself to 5 posts per day", 
            "Do not bait or prime the user to interact with your meme or profile. This includes, but is not limited to, asking for votes/comments/awards in the meme or title, implying that your post will/won’t make it out of new, pandering to users sorting by new/scrolling by, mentioning cakeday, petitions, etc.", 
            "Do not encourage or participate in brigading of any subreddits or of any users of Reddit or elsewhere, in any way, shape, or form! This is very against Reddit rules; action will be taken. This includes petitions!", 
            "Keep it dank! This sub is for humor (and the dankest of memes)!", 
            "If a post has graphic content, flair it as NSFW, else it will be removed! the same goes for spoilers", 
            "NO REEEEEEE-POSTS! This includes reposting your own posts! As a rule of thumb, if it has been posted elsewhere, it's probably been posted here already. Check with Karma Decay before posting! This includes chain posts. A post is only a repost if it has been posted on this sub before", 
            "Don't be a normie. If you post normie trash you could be banned! This includes, but is not limited to, Impact font (and fonts which look like Impact), minions, advice animals, rage comics, and the B emoji.", 
            "Posts must be formatted correctly. No posts where the title is the meme caption. The caption must be in the meme image, not in the submission title. (Basically, if the image makes sense to us by itself, it's fine. If the image requires the submission title for it to have any chance of making sense, we remove it.)", 
            "Direct links only! No albums or landing pages.", 
            "r/dankmemes is for dank memes, and is not a political campaign ground. Absurd memes about politicians are cool, but attempting to push a narrative or anything like that will result in a ban!"
        ]
    }, 
    "me_irl": {
        "popularity": 2790601, 
        "rules": [
            "Most people don't need to worry about this, but we do ban for posts with language or content that is harmful. Common things we see are posts demeaning to women, people of color, religious and cultural minorities, those with disabilities, fat people, sex workers, survivors of trauma/abuse, and gender and sexual minorities. We don't allow wiggle room for irony or reappropration, as we have no way of gauging someone's intent.", 
            "Nothing NSFW, nothing gross, and even if it's technically safe for work don't post something openly sexual.", 
            "Reactionary nonsense is banned", 
            "fucking screenshot of a fucking twitter jokeman", 
            "anything that asks for upvotes or karma, such as \"upvote in x for y\", \"if this gets x upvotes I'll y\", or \"they'll upvote anything\"", 
            "If your post is about sensitive subjects, like upsetting news stories or suicide, it isn't appropriate for me irl.\n\nDon't post horrible things, even if you're doing so to mock them.\n\nWe don't allow wiggle room for irony or reappropration, as we have no way of gauging someone's intent."
        ]
    }, 
    "woahdude": {
        "popularity": 2717404, 
        "rules": [
            "ALLOWED: Trippy or mesmerizing content that meets our listed WoahDude criteria. This is not a mere \"reaction subreddit\". Don't post content just because it makes you literally say the words 'woah dude'. \n\nNOT ALLOWED: Rare talents, stunts, extreme human abilities, 1-in-a-million shots, sports highlights. Things that are merely cool, amazing or unusual, but not in any psychedelic way.", 
            "Toxic behavior of any kind is not allowed. This includes (but is not limited to) trolling, vote brigading, comment brigading, drama brigading, baiting, harassing, taunting, insulting, spoiling, being antagonistic or needlessly bothering users or mods. This also includes making snide, condescending remarks such as \"im14andthisisdeep\" or \"iamverysmart\".\n\n([more info](https://www.reddit.com/r/woahdude/wiki/index#wiki_rule_2_-_no_toxic_behavior))", 
            "You must select the correct link flair. Adding flair after a removal will NOT get your post approved. \n\n([more info](https://www.reddit.com/r/woahdude/wiki/index#wiki_rule_3_-_link_flair_required))", 
            "Your post must use a descriptive title. Titles must describe the content, not your feelings or reactions to the content. \"woah\" or \"this is trippy\" is not a proper description.", 
            "If a post or comment contains content that can trigger bad vibes or epilepsy, you must manually type **[bad vibes]** or **[epilepsy]** in the title of the post, or before the content if in a comment.\n\n**NSFW** content and **SPOILERS** must be tagged as well. Our definitions of each may be more strict than yours, so err on the side of caution.\n\n**NSFL content is STRICTLY PROHIBITED.**\n\n([more info](https://www.reddit.com/r/woahdude/wiki/index#wiki_rule_5_-_warning_tags_required))", 
            "Do not post or request links to product info pages or store fronts (directly or indirectly) or provide, request, or express desire for any information that can facilitate the acquisition of such information. \n\nIf you want to advertise, [do it through the proper channel here](https://www.redditinc.com/advertising).\n\n([more info](https://www.reddit.com/r/woahdude/wiki/index#wiki_rule_6_-_no_product_advertising))", 
            "Reposts should generally be avoided. They are sometimes permitted, such as if the last submission was very long ago, and had very few votes.\n\n([more info](https://www.reddit.com/r/woahdude/wiki/index#wiki_rule_7_-_repost_policy))", 
            "Only post content if it actually belongs according to both the letter and spirit of our rules. You may be banned if it appears you are posting content for no other reason than to gain karma, self promote, or pad your account history. \n\nAvoid posting: Quasi-reposts, Low quality files, Uninteresting content. \n\n([more info](https://www.reddit.com/r/woahdude/wiki/index#wiki_rule_8_-_no_low-effort_submissions))", 
            "If you spot content that you think violates any rule, use the report button or modmail us. Do not air your grievances in the comment section. Again -- contact the actual mods.\n\nMore often than not, users who back-seat mod don't even understand our rules to begin with themselves, and are only misleading people about what our rules actually are.\n\n([more info](https://www.reddit.com/r/woahdude/wiki/index#wiki_rule_8_-_no_back-seat_modding))", 
            "When submitting images, link **directly to the image file** and not any page that contains extra nonsense like ads, related images/thumbnails, or comment threads. \n\nWhen submitting videos, link directly to the hosting website (i.e. youtube, vimeo) and not a video embedded on some random blog or sites like ebaumsworld.\n\nDo not use URL shorteners, redirects, or link to rehosted content or blogspam.\n\n([more info](https://www.reddit.com/r/woahdude/wiki/index#wiki_rule_10_-_use_direct_links))", 
            "Crossposts (also known as XPOSTS) are fine, just don't label them as such.\n\nAlso, do not submit links to other subreddit posts or thread. Instead, you must create a brand new post here, or use Reddit's built-in crosspost function. \n\n([more info](https://www.reddit.com/r/woahdude/wiki/index#wiki_rule_11_-_xpost_labels_are_banned))", 
            "Avoid posting content that is watermarked or rehosted by a party other than the author without their permission for personal or monetary gain."
        ]
    }, 
    "NatureIsFuckingLit": {
        "popularity": 2704750, 
        "rules": [
            "Posts on this subreddit must be exciting and interesting. For an idea of what \"lit\" means, browse the top posts of the subreddit.\n\nPlease do not submit sunrises, sunsets, or other content which does not have an element of 'wow-factor'.\n\nHigh-energy is relative depending on the subject of your post. A picture of a snail is judged against other submissions of snails, not one of a cheetah.", 
            "Every post title must begin with the fire emoji and a space.\n\nExample: \"🔥 \" before every title.\n\nThe fire emoji defines this community.\n\nIf a post can be posted in this subreddit, it can be described as 🔥🔥🔥.\n\nHaving your title start with \"🔥 \" allows the rest of the title to be searched on the subreddit easily, which helps the moderators to remove reposts.\n\nYour post will be auto-removed if you do not follow this rule.", 
            "This is /r/NatureIsFuckingLit, a nature appreciation subreddit: content must contain nature. \n\nNo posting of non-wild (captive) or domesticated animals. No content involving people harming or harassing animals. No posting of photoshopped or otherwise excessively and unnecessarily manipulated images. ", 
            "Titles should be accurate and descriptive: low effort titles will be removed. Include the animal/plant name, a location, and brief description to the best of your ability. Titles cannot say \"[Subject] is Lit\". \n\nPlease feel free to resubmit your post with an accurate and descriptive title.", 
            "No posts that have been previously posted on this subreddit within 120 days (4 months) may be posted again. No posts that have previously been posted on this subreddit with over 10,000 upvotes in the past year may be posted again.\n\nSearch the subreddit for key terms like the animal name before posting to check if your post is a repost. You can also use KarmaDecay and Google Reverse Image Search.", 
            "We do not allow NSFW content: bloody, gory and violent content can be redirected to our sister subreddit /r/natureismetal. ", 
            "This subreddit is called Nature Is Fucking Lit.\n\nIf you are posting here, your content is already lit. You don't need to convince anyone in the title.\n\nBefore this rule, almost all titles had some variant of \"[Blank] is lit\" or \"[Blank] is 🔥\" with very little description otherwise.\n\nWrite a creative title that describes the content, not one that has to convince viewers the content is lit.", 
            "No politics, race, religion, gender, sexual orientation or similar topics. We are here for the awesomeness of nature: these topics will be removed."
        ]
    }, 
    "Tinder": {
        "popularity": 2701659, 
        "rules": [
            "NSFW posts are allowed, but if you see a post violating any laws or Reddit's rules please report it.", 
            "Images that contain personal information (phone numbers, addresses, Facebook accounts, unique/easily identifiable names, or other similar information) will be removed.", 
            "Posts of profiles/conversations with bots, ads, or fakes will be removed.", 
            "Posting a profile only because it mentions /r/Tinder or reddit, asking for upvotes/gold, or posts asking to hit the front page in order to get laid are all karmawhoring tactics which have occurred dozens of times on this subreddit. This includes posts made to try to contact specific redditors from tinder. Each time, they get dozens of reports. The mods are listening; this kind of content is forbidden and will get you banned.\n\nAsking for upvotes/gold in posts and/or comments is also forbidden.", 
            "Posts made to bully, and comments which are harassing a certain user or group of users, including slurs, may result in bans. Rudeness, hatred towards a group or groups of people, and acting like a jerk are prohibited. Personal attacks, slapfights, slurs, and other similar comments are not allowed.", 
            "All posts must be directly related to Tinder or dating apps. Reactions (gifs or images), memes, related websites, and other non-dating app content will be removed. This subreddit is for screenshots and stories directly relating to them."
        ]
    }, 
    "PS4": {
        "popularity": 2683574, 
        "rules": [
            " Please just keep it civil.", 
            "Do not share links or discussions regarding piracy, hacking, jailbreaking, game images, \"backup\" software, attacker groups, etc.  No requesting others to game/account share with you.", 
            "Do not post unmarked spoilers or put ANY spoilers in a post title.  Spoiler formatting is simple to use and works on most mobile devices as well.\n\n* For submissions, include the tag [Spoilers] in the the title.\n\n* For comments use the following formatting:\n\n `[Game Spoiler](#s \"This is where your spoiler goes!\")`\n\n Result: [Game Spoiler](#s \"This is where your spoiler goes!\")\n\nNSFW content must be properly marked as per [reddit's rules](https://reddit.com/rules).", 
            "Article links with heavily editorialized user titles are not allowed.\n\nPosts without a *substantial* part of their question or topic in the title will be removed. Rule of thumb: If your question can fit in the title, then it should be in the title. ([examples of vague titles](/r/PS4/wiki/subreddit/rules/examples#wiki_vague_titles))\n\n[Examples of topics deemed too general can be found here.](/r/PS4/wiki/subreddit/rules/examples#wiki_posts_about_generalities)\n\nDuplicate posts may be removed", 
            "All screenshot and video submissions should include the [Game Name] and [Media Type] in the title.  The [Media Type] must include brackets and be either [Screenshot], [Image], [Gif], or [Video].  \n\n[You can find examples of ideal media submission titles here.](http://www.reddit.com/r/PS4/wiki/subreddit/rules/examples#wiki_captured_screenshots_and_videos)\n\n^(Note: Website, email, and texting screenshots aren't allowed. Playroom screenshots and videos aren't allowed.)  ", 
            "All suggestions for games, features, etc. must be accompanied by a way to get your idea into the hands of those who can make it happen. This means at least *one of the following* should be included:\n\n\\- A specific suggestion from **http://share.blog.us.playstation.com** with the suggestion link included.  \n\\- A Twitter #HashTag (try to be catchy), Twitter accounts, email addresses, etc. of the dev/publisher/company for folks to contact.  \n\\- Moderator pre-approval\n\nPetitions are **NOT** allowed.", 
            "The following posts aren't allowed:\n\n* **Reaction Gifs, Memes, etc**\n\n* **Show-off / Bragging** - Including (but not limited to): purchases, personal live streams, [trophies](/r/Trophies), [hardware skins](/r/PS4Mods), messages, spotify playlists, etc at mod discretion.\n\n* **Requests** - Including (but not limited to): [friend requests](/r/PSNFriends), [Share Play requests](/r/PSNSharePlay), or [deal requests](/r/PS4Deals).\n\n* Questions that can be answered with a simple Google/subreddit search\n", 
            "**Review Thread Requirements**\n\n1. A [Metacritic](http://www.metacritic.com/game) or [OpenCritic](http://opencritic.com) link to the game is required in the main post.\n\n **Recommended**: Sort sites in alphabetical/reverse alphabetical order to avoid score bias.\n\n**Crowd-funding Post Requirements**\n\nThese are allowed under the following two circumstances:\n\n1. The kickstarted project has not been posted already.\n\n2. It is the final 48 hours and it has not been posted previously in that time frame.", 
            "* When a megathread for a game has been posted, other posts related to the game are not allowed **for 24 hours** after.\n\n* When an official discussion thread for a game is **stickied**, other posts discussing game are not allowed (with the exception of news and technical issues).\n\n* During events like E3, submissions will often be locked until the end of the press briefing and discussion will be directed to an event thread. This is to prevent the massive amount of posts after every announcement.", 
            "What do we consider spam?\n\n* Posts unrelated to PS4\n\n* Blogspam. [What is blogspam?](/r/PS4/wiki/subreddit/rules/blogspam)\n\n* Pictures of websites/emails (without other detailed context via self-post/article).   Backup/mirror images of sites in comments are NOT considered spam.\n\n* Self-promotion. No buying, selling, trading, or begging for anything.  Don't promote things you have a personal or financial stake in.  For personal projects related to PS4, speak with the moderators before posting."
        ]
    }, 
    "nba": {
        "popularity": 2672928, 
        "rules": [
            "There are obvious reasons why we don't allow people to personally insult others, and doing so will get you banned. It makes everyone feel a little less welcome. Note: this rule applies to messages in modmail, as well.", 
            "Do not post or comment with the purpose of trolling or inciting reactions from other users. This will lead to a ban. Don't be offensive just to be offensive.", 
            "This is an automatic ban. We want everyone no matter their age, gender, sexual preferences, or race to feel welcome in this subreddit. This includes jokes or quotes that include such language.", 
            "Make sure the content you are posting has not already been submitted.", 
            "Any blatant attempt to grab attention or troll with a fake news headline will result in a permanent ban.  Make sure your news comes from a reputable source.", 
            "Self promotion includes, but is not limited to:\n\n* Promoting or linking to your youtube channel, site, blog, etc.\n* Promoting or linking to your design website, fan art, logo or court redesigns, etc\n* Trying to sell merchandise (t-shirts, jerseys, artwork, etc)\n\nThere's a big difference between people that are trying to use our subreddit for their own personal gain and people that are just trying to share something with the community.", 
            "NSFW content will be removed and violators will be banned.", 
            "Posts that are irrelevant for this subreddit include, but is not limited to: video games, 2K, fantasy, gambling and college players.\n\nComments that purposely derail the discussion of the post may lead to a ban."
        ]
    }, 
    "relationships": {
        "popularity": 2637480, 
        "rules": [
            "Posts must include:\n- Ages, genders and relationship length\n- Include a TL;DR! - a brief summary at the end of your post. No \"See title\".**\n- Sufficient spelling, grammar and formatting to be readable", 
            "Posts must be:\n\n- First person, not for someone else\n- Specific, clearly stated questions about your situation, not general, polling etc.\n- A desire for input, not just to vent", 
            "- No general questions, polling or ‘opinion gathering’.\n- No meta complaints (about the sub). If you are unhappy here, reddit elsewhere.\n- No questions directed at a single gender or group.\n- No politics!\n- No gift or activity questions.\n- Updates -\"UPDATE\" needs to be in the title. Link to the previous post, which cannot be deleted or removed. Original post more than 48 hours old. One update only. ", 
            "- Do not fight or feed the trolls. Use the report button instead!\n- No abuse and victim blaming!\n- Do not use uncivil, negatively gendered, ableist, sexist or bigoted language.\n- Avoid tangential discussions, focus on helping posters\n- No photos, links, or videos\n- Do not post or request personal information that can be used to trace you\n- Do not mention upvotes or downvotes. We do not allow vote manipulation.\n- Do not use the sub to push your personal agenda", 
            "We provide instant bans for:\n\n- Advocating, suggesting or justifying violence. Even as a joke.\n- Crossposting content from here to another sub, including your own page\n- Do not repost removed material\n- Egregious bigotry and abusiveness\n- Brigading", 
            "- Be respectful to posters and other commenters\n- Focus on helping the OP\n- Use your experience to form advice but put yourself in the place of others as well\n- Thank people for good advice\n- If you are tempted to make an angry reply, use the report button instead"
        ]
    }, 
    "AnimalsBeingBros": {
        "popularity": 2628200, 
        "rules": [
            "Please only post animals being bros. **Do not post sleeping animals, animals just existing or animals engaging in normal animal behavior.** Do not posts images with superimposed text adding context for the 'bro' action to be understood. Your post should be able to stand on its own without help from the title or additional text.", 
            "**Refrain from promoting hate speech, racism, sexism, religion-bashing, name-calling, insults, and any other abusive/threatening language.Refrain fro posting political material.** \"Abusive language\" includes posts which are malicious or insulting in nature.", 
            "**Do not post content that is already in the [top 50 posts of all time](http://www.reddit.com/r/AnimalsBeingBros/top/).** You can check for reposts from your posts page [here]( http://karmadecay.com/r/AnimalsBeingBros?url=ref). Recent reposts will also be removed. Reposts within 3 months of each other will be removed.\n\nIf you submit a post that has already been reposted **more than 3 times, your post will get removed**.\n", 
            " If your post is NSFW, please label it as such.", 
            "No memes or comics.", 
            "No compilation videos, gifs, pictures, etc."
        ]
    }, 
    "AnimalsBeingJerks": {
        "popularity": 2588583, 
        "rules": [
            "Please only post animals being jerks, not humans being jerks", 
            "We're here to have a laugh, please keep posts funny. That means no posts of animals being killed or seriously injured.", 
            "Do not post content that is already in the [top 50 posts of all time.](http://www.reddit.com/r/AnimalsBeingJerks/top/) You can check for reposts by copying the link and pasting [here]( http://karmadecay.com/r/animalsbeingjerks?url=ref). Recent reposts will also be removed. Reposts within 3 months of each other will be removed. Reposts may also result in a ban. \n\nIf you submit a post that has already been reposted more than 3 times, your post will get removed. ", 
            "If your post is NSFW, please label it as such.", 
            "**Refrain from promoting hate speech, racism, sexism, religion-bashing, name-calling, insults, and any other abusive/threatening language.** \"Abusive language\" includes posts which are malicious or insulting in nature.", 
            "No memes or comics. No compilations of any sort.", 
            "Posts must depict animals actually being jerks. Please do not post animals engaging in normal animal behavior which might simply inconvenience humans, and do not make posts which require you to add context for the jerky behavior to be understood. Moderators will remove such posts at their discretion.", 
            "All submissions must show an animal actively being a jerk. Animals posing next to shredded pillows etc are not allowed.  The jerkiness must be evident from the material posted."
        ]
    }, 
    "tattoos": {
        "popularity": 2548225, 
        "rules": [
            "**Artists and apprentices:**\n\n If you wish to post or comment as such, please get verified before doing so. Do not post or comment as an artist until this is done and you have your artist flair. Accounts must be at least 30 days old to become verified. We do not allow shop accounts. Once verified please limit self-promotion to **one post per day.**", 
            "WE REQUIRE:\n\n* Artist **name and location** (shop/city) in your title\n* Color, well lit, unfiltered, non-instagram, properly cropped and rotated, close-up, CLEAR PICTURES (Make sure we can SEE the tattoo)\n* NSFW flags for NSFW posts\n* Anything that is *not* a picture of **your own** tattoo must be submitted as a self post. This means questions, sketches, flash, etc. **You may not post photos of tattoos unless they are yours.**\n\n*YOUR POST WILL BE REMOVED IF IT FAILS TO MEET THE ABOVE CRITERIA.*\n", 
            "**WE FORBID:**\n\n* **Any** attacks, advances, compliments or comments made on personal appearance.", 
            "**WE FORBID:**\n \n* **Hate speech** (sexuality slurs, racial slurs, religious slurs) **will get you banned permanently. Even if you think you mean it as a \"joke\".**", 
            "**WE FORBID:**\n\n* **Any questions about whether a tattoo will \"work\"** or how to add to your tattoo. Only a qualified artist will be able to answer your question and discussion on Reddit will only lead to misinformation. *Ask your tattoo artist.*", 
            "**WE FORBID:**\n\n* **[ANY discussion of medical advice or aftercare](https://www.reddit.com/r/tattoos/comments/3cth6c/reminder_about_medical_and_aftercare_advice_from/)**, including possible allergic reaction or infection. If you are having an issue with a tattoo, return to your artist or ask a medical professional. **Any and all medical questions or advice will be removed.**", 
            "**WE FORBID:**\n\n* Memes, rage comics, reaction gifs, \"top 10\" style lists, blog posts, pun threads, and other copypasta.", 
            "**WE FORBID:**\n\n* **Tattoos performed outside of a professional studio**: prison tattoos, scratchers, bootleggers, kitchen magicians, etc. This includes tattoos done in someone's home.", 
            "**WE FORBID:**\n\n* [Talking about pricing **in any context.**](http://www.reddit.com/r/tattoos/comments/19epxy/reddit_didnt_seem_to_like_the_last_tattoo_i/c8nohda)", 
            "**WE FORBID:**\n\n* Posting work that is not yours as your own."
        ]
    }, 
    "Overwatch": {
        "popularity": 2545222, 
        "rules": [
            "**IMPORTANT**\n\nThese are **not** our complete rules. We utilize the page so our users have proper reporting reasons. To read our rules, please visit [the rules page on our wiki](https://www.reddit.com/r/Overwatch/wiki/rules).", 
            "-"
        ]
    }, 
    "Whatcouldgowrong": {
        "popularity": 2514874, 
        "rules": [
            "Golden Rule: Links must contain a stupid idea and something going wrong.", 
            "Direct links to gifs/videos/pics only. (Gfycat.com is great for gifs). No compilation videos are allowed. Also, posting a pic of text describing the event is not acceptable. Crossposts are allowed, but the original has to still exist.", 
            "Tag your material with NSFW if it is NSFW. Any posts involving severe injury needs to include NSFL in the title. Overly NSFW material will be removed.", 
            "No death posts, no young children getting injured.", 
            "Mods can remove reposts, obscene material, racism, and sexism at their discretion, and banning will ensue on first offense", 
            "WCGW is not intended to be a place to post gifs and videos of people simply getting into fights.  Understandably, fights may occur in posts, but your post cannot be submitted on the basis that fights are a stupid idea.  There has to be other substance there."
        ]
    }, 
    "atheism": {
        "popularity": 2473728, 
        "rules": [
            "No Trolling: This includes the repeated use of slurs to incite or instigate (i.e. trolling) and applies to all forms of user content, including the user's name.\n\nComments that are \"in character\" for /r/magicskyfairy or other \"circlejerk\" subreddits and circlejerk catch phrases will be removed. Examples include \"this is euphoric!,\" \"tips fedora,\" \"so brave/edgy,\".", 
            "Harassment and bigotry are strictly prohibited, but any and all curse words are permitted. (applies to all forms of user content, including the user's name.)", 
            "Keep things civil. Avoid fighting words and personal attacks. (applies to all forms of user content, including the user's name.)", 
            "Submissions completely unrelated to atheism, agnosticism and secular living may be removed.\n\nTrigger Warning: This is a community in favor of scientific understanding, equality for everyone, and positive secularism, also we oppose religious influence and over-reaching. Things such as LGBT, Science News, politics, and similar discussions are often of interest to atheists, and will be considered relevant to this subreddit.", 
            "All image posts must be submitted as self posts. (This includes links to image only content on a 3rd party site.)", 
            "If you're linked via a meta subreddit don't vote. If you're just going in there to shitpost or get into an argument, don't comment. If you actually have something that is worthwhile to contribute and isn't trying to shove your viewpoint down everyone's throats, think first before commenting. If you legitimately find the thread on your own (you can be subscribed to both meta subs and a sub that's been linked to without getting nuked for brigading) please feel free to comment and vote.", 
            "Usually when done in excess. (ie. more than 1 in 10 posts/comments)", 
            "Posts which only contain a title are not allowed and will be removed. Posts should contain significant content or discussion relevant to the title. Simply adding filler text to the body does not meet this requirement.\n\nIf your post is a question, please include your thoughts on the topic as well in the body of the post"
        ]
    }, 
    "gameofthrones": {
        "popularity": 2278490, 
        "rules": [
            "[All content must be relevant to the ASOIAF universe.](https://goo.gl/qncA5H)  Random actor photos or things that remind you of GOT/ASOIAF but are not direct references to the show or books are no longer allowed.", 
            "[Meta posts](https://goo.gl/qncA5H) about the sub, including bug reports and flair issues, should be [sent to the moderators via modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fthronestest).", 
            "[All spoilers and theories must have clear and specific warning.](https://goo.gl/3Ygxxl)  Titles and thumbnails can't contain spoilers.  The combination of the title text and thumbnail can't be a spoiler. Origin theory formulas like A+B=C that deal with Jon Snow can't be in titles.  Comment information that's outside a post's title scope should be covered with a spoiler tag.", 
            "[Content must be high quality and provide unique value to the subreddit](https://goo.gl/kd3IEs)  Simple text-on-image meme-style jokes, face swaps, and similar quick photoshops are no longer allowed.  Reaction images and merchandise posts are only allowed if they promote discussion of the show/books or have unique creative value.", 
            "[Reposted content must be old enough to be considered fresh again.](https://goo.gl/kd3IEs) The time to wait varies based on this schedule:\n\n  * April-June = 1-week limit\n  * July-August = 2-week limit\n  * September-January = 1-month limit\n  * February-March = 2-week limit", 
            "[All content must be respectful and mature.](https://goo.gl/1JonGI)  This is a no-drama subreddit. Needlessly inflammatory or offensive comments that stir up drama are not allowed. ", 
            "[All content must be respectful and mature.](https://goo.gl/1JonGI)  Sexual objectification of the actors, characters, or other redditors is not allowed, regardless of age or gender.  Discussion of sex acts involving a Redditor is outside the subreddit scope.\n", 
            "[Content must not facilitate piracy or other illegal acts.](https://goo.gl/4x2nRj) Providing or asking for information about getting free/pirated show or book media is not allowed.  This includes names of sites, piracy subreddits, or asking people to PM for the information. \n", 
            "[Content must not facilitate piracy or other illegal acts.](https://goo.gl/4x2nRj) Content posted for sale that that includes copyrighted media, such as the HBO show's sigils or world maps, must be legally licensed. "
        ]
    }, 
    "programming": {
        "popularity": 2271344, 
        "rules": [
            "Submissions should be directly related to programming.  Just because it has a computer in it doesn't make it programming.\n\nSubmissions containing no real content that are simply farming for e-mail addresses will be removed as spam.\n\nDirect links to app demos (unrelated to programming) will be removed.  Please link to a blog post/post-mortem about the development process instead.", 
            "Surveys/polls are typically obnoxious.  Pretty much any survey, academic or otherwise, will be removed by the mod team.  Check out /r/samplesize as an alternative place to submit surveys.\n\nExceptions are made for high quality surveys hosted by established members of the software development community (really just the annual SO Developer Survey).", 
            "/r/programming is not a jobs board.  Please visit /r/forhire or /r/jobbit for submitting résumés or open positions.\n\nSubmissions on the topic of hiring programmers or getting hired as a programmer are generally acceptable, as long as they are not a résumés or an ad for an open position in disguise.", 
            "/r/programming is not a support forum. If you have a question, check out /r/learnprogramming, /r/cscareerquestions, or [Stack Overflow](https://stackoverflow.com/).", 
            "Reddit may have relaxed its position on self-promotion, but /r/programming has not:\n\n* If a majority of your contributions to reddit constitute self-promotion, you will be banned\n* If you immediately start submitting promotional material with a fresh account, you will be banned\n* The mods of /r/programming all have day jobs, we do not waste time handing out warnings\n\nIf you wish to use reddit as a promotional tool, [please do so legitimately](https://about.reddit.com/advertise/)."
        ]
    }, 
    "BikiniBottomTwitter": {
        "popularity": 2267721, 
        "rules": [
            "Do not post content just because it features a resident of Bikini Bottom. If you want a sub catered to that sort of thing, check out r/Spongebob. As for here, this is for memes and for memes only.", 
            "No racism against squirrels. No hate speech. No posts about how different Pearl is from her father.", 
            "Do not put the punchline in the title of the post. Having a funny picture of a Bikini Bottom resident and using the title as the punchline does not make your post a meme.", 
            "Do not post really low-effort memes. Using excessively overdone and/or outdated templets, posting something that is excruciatingly unfunny, posting something that simply doesn't make any sense... you get the idea.", 
            "No reposts allowed. [Use this nifty little tool to determine whether or not your post has already been here.](https://reverse.photos/)"
        ]
    }, 
    "gonewild": {
        "popularity": 2254224, 
        "rules": [
            "Gonewild is a place for open-minded Adult Redditors to exchange their nude bodies for karma; showing it off in a comfortable environment without pressure. You may be required to submit verification and prove you're the one in the photos. Consent is a critical part of the overall health of this community.", 
            "**Report any comments or threads you find abusive.** We check the reported queue often. If you come across a user being mean spirited or posting personal info, click the report link. When you argue with a troll, you are entering a competition to see who has more free time. You will lose, because you have a life and the troll does not. **Do not EVER respond to trolls. Instead, report them!**", 
            "If you sell panties, fetish items, cam shows, ask for donations (PayPal, Cash App, etc.) or anything similar **ANYWHERE on Reddit** (this includes your profile page), and wish to post to Gonewild, please do so under a separate account. We wish to remain separated from all money-making endeavors, so that Gonewild remains a purely exhibitionists' subreddit where people post for absolutely no other reason than the thrill of it.", 
            "Vote manipulation violates Reddit site-wide rules as well as the rules of /r/gonewild.", 
            "All people are welcome to post here, but you must use appropriate tags. Be respectful. Don't insult the ones brave enough to submit photos/videos. If you don't want to see dicks then don't open the ones with the [m] tag... it'll likely be dicks. Feel free to be creative and play with this tag. A [CD] (cross dresser) tag, [t] (transgender) tag, or simply a [?] are also admissible, with the understanding that if someone clicks on a [?] they don't mind a surprise.", 
            "When you argue with a troll, you are entering a competition to see who has more free time. You will lose, because you have a life and the troll does not. Do not EVER respond to trolls. Instead, report them!", 
            "Respect the anonymity of our users or be banned. If you link to another user's personal info/content outside Reddit--if you so much as try to guess a name--you will be shown the door.", 
            "Do not post, comment, or otherwise list or request off-site contact details (Snapchat, kik, Tumblr, Twitter, Instagram, Pornhub, etc.) here, on your profile page or other subreddits.", 
            "This poster has the 'verified' flair but has deleted their verification post."
        ]
    }, 
    "Unexpected": {
        "popularity": 2243059, 
        "rules": [
            "Submissions must be unexpected on their own, and not rely on their title to surprise the reader. Don't give the outcome away in the title.", 
            "Do NOT rehost webcomics. You may provide an imgur mirror in the comments.", 
            "Mark all NSFW/NSFL submissions as such. ", 
            "Keep the comments civil; no flamewars or insults. Follow good [Reddiquette.](http://www.reddit.com/wiki/reddiquette)", 
            "Please look through our [Top submissions](http://www.reddit.com/r/Unexpected/top/) to avoid reposts. Frequent or recent reposts may be removed.", 
            "Submissions should be unexpected in some form.", 
            "No Pictures of text - visit /r/unextexted ", 
            "Any form of bigotry will not be tolerated on this subreddit.", 
            "Death isn't allowed on /r/unexpected anymore, please visit the appropriate subs. "
        ]
    }, 
    "malefashionadvice": {
        "popularity": 2195380, 
        "rules": [
            "\"[Giving advice](https://www.reddit.com/r/malefashionadvice/wiki/rules#wiki_2.2_giving_advice)\" is interpreted broadly to include inspiration albums, discussion topics, product reviews, and some product announcements, but does not include posts about an item you just bought or an outfit you're wearing unless you have a specific question about it.", 
            "[Personal attacks, insults and intentionally demeaning comments](https://www.reddit.com/r/malefashionadvice/wiki/rules#wiki_rule_.231) such as those based on sexual orientation, race, gender, weight, fitness, body type or other social profile are strictly prohibited. Comments will be removed and will result in being banned. Note that [unsolicited comments](https://redd.it/35v9qr) regarding fitness, weight, and body type are also not allowed even if they are not intended as insults.", 
            "All short, simple questions must be asked in the [Daily Questions](https://www.reddit.com/r/malefashionadvice/search?q=author%3AAutoModerator+Daily+Questions&restrict_sr=on&sort=new&t=all) thread stickied at the top of the subreddit.\n\nFor clarification on what does and does not constitute a Simple Question please see: [here](https://www.reddit.com/r/malefashionadvice/wiki/rules#wiki_simple_questions)", 
            "* **Inspiration albums:** must have 25+ images and an accompanying write up\n* **Reviews:** must disclose if the item was given for free or on discount\n* **Outfit grids:** must have 10+ images and an accompanying write up\n*  **Killshot 'Alternative' posts:** single image restock, alternative and purchases are not allowed.\n* **DIY posts:** are allowed but please add an accompanying write up. Note for small brands and startups: items you make for sale count as spam and marketing.", 
            "All questions and requests for advice must be submitted as text-based self-posts using the \"Create Post\" button at the top of the sidebar.", 
            "All [marketing efforts](/r/malefashionadvice/wiki/rules#wiki_no_marketing) are prohibited and will be removed. This includes giveaways, discounts, and market research. \n\nPlease also see Reddit's rules on [spam](http://www.reddit.com/wiki/faq#wiki_what_constitutes_spam.3F) and [self-promotion](http://www.reddit.com/wiki/selfpromotion). In particular, \"If over 10% of your submissions and/or comments are your own site/content/affiliate links, you're almost certainly a spammer.\"", 
            "No sale/coupon announcements are allowed. Please visit /r/frugalmalefashion instead.\n\nPersonal sales are not allowed as posts. They are allowed as comments but only in the recurring [Buy and Sell threads](https://www.reddit.com/r/malefashionadvice/search?q=Buy+Sell+thread+-+&restrict_sr=on&sort=new&t=all).", 
            "Online crowdfunding campaigns are not permitted. Fundraiser links posted by brand-new accounts will be treated as spam and removed and account will be banned. Referral links are not permitted. ", 
            "All hair, skincare, fitness, and grooming questions are reserved for the recurring [Hair, Skincare, Fragrance, and Fitness Thread](https://www.reddit.com/r/malefashionadvice/search?q=author%3AAutoModerator+Hair%2C+Skincare%2C+Fragrance%2C+and+Fitness+Thread&restrict_sr=on&sort=new&t=all) (posted every Tuesday, Thursday). Any posts, including self-posts, about those subjects will be automatically removed.", 
            "It's fine to post pictures of yourself or public figures/celebrities, but please respect their privacy and don't post pictures of friends or strangers. Note that this also applies to pictures of you with a date, girlfriend, spouse or anyone else - crop them out, obscure their face, or use a different picture. Users will be asked to do so, or image will be removed.", 
            "Joke and meme posts are not allowed. They can be shared in the daily [General Discussion](https://www.reddit.com/r/malefashionadvice/search?q=author%3AAutoModerator+General+Discussion&restrict_sr=on&sort=new&t=all) threads, or other more suitable subreddits like /r/mfa_irl and /r/mfacirclejerk."
        ]
    }, 
    "europe": {
        "popularity": 2181358, 
        "rules": [
            "[Read our geo policy](https://www.reddit.com/r/europe/wiki/geopolicy) ", 
            "Including different sources covering the same story without providing new information.", 
            "personal attacks: Stick to the topic at hand and remain civil towards other users - attacking ideas is fine, attacking other users is not. This also includes calling somebody a racist, a SJW, a commie, a Russian-bot, a shill or similar in isolation. If you believe somebody is pushing an agenda, report it or send us a mod mail. Don't take it to the comments.", 
            "Use /r/casualeurope during the week instead."
        ]
    }, 
    "boardgames": {
        "popularity": 2170774, 
        "rules": [
            " * Rarely discuss behavior.\n * Almost never criticize people.\n * Ask yourself if you will be intruding into someone's personal space before commenting or PMing.\n * When discussing behavior or people: slow down and do it with care, respect, and distance.\n * Be kind: picture a valued person in your life while you write.\n * Be considerate of time: trim down and structure long posts and comments\n\n[More](https://www.reddit.com/r/boardgames/wiki/community#wiki_behave_civilly)", 
            "* Read other people's posts. \n* Comment mostly on other people's posts. \n* Comment far more than you post. \n* Talk about different games. \n* Talk about more than one site, channel or idea.\n\nIf you do those, then occasionally: \n\n* Share novel information from sites and channels you haven't recently posted about.\n\n\n[See here](https://www.reddit.com/r/boardgames/wiki/community#wiki_participate_in_the_conversation) for more.\n", 
            "After someone posts about a game undergoing crowdfunding, no one else can for 4 days. (The [kickstarter roundup](https://www.reddit.com/r/boardgames/search?q=Kickstarter+Roundup+author%3AZelbinian&restrict_sr=on&sort=new&t=all) is an exception.)\n\nWhen reporting, consider sending a modmail with the last post on that game.\n\n[More here](https://www.reddit.com/r/boardgames/wiki/contribution-guides#wiki_share_a_game_undergoing_crowdfunding_or_a_pre-orderable_game) on Crowdfunding", 
            "Go to [our Bazaar](https://www.reddit.com/r/boardgames/search?q=Board+Game+Bazaar&sort=new&restrict_sr=on&t=all) to directly get price quotes on games or to buy/sell/trade them.", 
            "There is a daily mega-thread about games recommendations [tailored to a personal situation](https://www.reddit.com/r/boardgames/wiki/contribution-guides#wiki_ask_for_a_personalized_game_recommendation). \n\n[Discussions about groups of games that keep all personal situation out of the post body](https://www.reddit.com/r/boardgames/wiki/contribution-guides#wiki_start_a_discussion_about_a_group_of_games) are generally allowed as long as phrased in a way that's quite applicable to others.", 
            "[We have a step-by-step guide on this](https://www.reddit.com/r/boardgames/wiki/contribution-guides#wiki_share_picture.28s.29_about_a_single_game). Posts featuring images have high standards to not be removed. Link posts will almost always be removed. ", 
            "Posts must include \"[COMC]\" in the subject line.\nNO direct image links. Text posts with links to the collection images are required.\nUsers must answer “How long have you been involved in the hobby?” and “What would you change about your collection if you could?” \nExpect people to ask about your collection and be prepared to answer them.\nThe intent is to give an idea of your whole collection, not just a few games from it.\n", 
            "We keep a *very* publisher-friendly stance here with regards to intellectual property. \n\nGames should obscure part of their artwork/text to prevent reproduction.\n\n[See here](https://www.reddit.com/r/boardgames/wiki/contribution-guides#wiki_share_picture.28s.29_about_a_single_game) for suggestions on posting images to comply with these moderation standards.", 
            "Affiliate links are links with codes in them which makes someone get paid/credit for marketing. We don't outright ban them, but they have to be posted right to be allowed, and must otherwise be in a post that's acceptable.\n\n1. Make a text post.\n2. Prominently mark each affiliate link as such.\n3. Provide a corresponding non-affiliate link for each link.\n4. Do not use affiliate links in comments.\n\n[See Here](https://www.reddit.com/r/boardgames/wiki/contribution-guides#wiki_post_affiliate_links)", 
            "Keep hidden the secrets about games that must be hidden to play such as scenario details.\n\nHigh level details should be hidden for the year of release and the next year.\n\nUse the spoiler tag around each paragraph that contains surprises in all contributions\n\nPrefix post titles with [Spoiler] and be clear enough people can avoid it\n\n[See here](https://www.reddit.com/r/boardgames/wiki/contribution-guides#wiki_talk_about_parts_of_games_that_are_designed_to_be_surprises) for the full explanation"
        ]
    }, 
    "PewdiepieSubmissions": {
        "popularity": 2144125, 
        "rules": [
            "This violates the content policy found [here](https://www.reddit.com/help/contentpolicy)\n\n\n", 
            "2. No NSFW. It won't be fit for LWIAY anyway.", 
            "No Hatespeech of ANY kind. This includes a wide variety of things. Basically, don't be a dick. make sure to hit report on any violations you see.", 
            "If a post has been posted on r/pewdiepiesubmissions before, don't post it again. this does NOT apply to crossposting", 
            "No brigading / raiding other subreddits and/or websites"
        ]
    }, 
    "gardening": {
        "popularity": 2111400, 
        "rules": [
            "We do not tolerate advertising or self-promotion of any kind.", 
            "Abusive or offensive content will result in an immediate ban. Moderators are the sole arbiters on what constitutes offensive content.", 
            "Please do not repost anything for the sake of karma. If you are going to repost something, it should be for the sake of learning new things, cross-posting, or bringing up a question asked previously on this sub for advice."
        ]
    }, 
    "pokemongo": {
        "popularity": 2108843, 
        "rules": [
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)", 
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)", 
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)", 
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)", 
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)", 
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)", 
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)", 
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)", 
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)", 
            "A full description of this rule is available [here](https://www.reddit.com/r/PokemonGo/wiki/rules)"
        ]
    }, 
    "relationship_advice": {
        "popularity": 2049226, 
        "rules": [
            "Titles should be a summary of the problem and not just generic titles like \"need help\"", 
            " Situation descriptions should be detailed and in include ages and genders of everyone involved, length of the relationship, and (general) geographical location.", 
            "Posts need to have a question or a request for advice on a specific relationship scenario.  Posts that DO NOT fit this rule include Rants, Unsolicited advice, General discussion topics, Hypothetical questions, Social experiments, and Fetish discussion.", 
            "No name calling, insults, harassment, or threats. We don't care who started it.  ", 
            "Comments should be in regards to the post or comment its replying to.", 
            "We have a zero tolerance policy on comments about suggesting suicide or violence, be it seriously, sarcastically, humorously, etc.  Violators will be banned.", 
            "Stereotyping or making blanket statements about a gender, race, or other group is not allowed. For example: \"All women do X\" or \"All men are Y\", etc. These comments will be removed if reported.", 
            "Updates that request specific, new advice for a new situation that's different than the old request are totally fine. Updates providing play-by-play events of what's going on without asking for new advice, on the other hand, would be best served for a blog. Still, we can allow one such update once everything on this topic has reached a conclusion (i.e. \"Hey, thanks Reddit! Here's how it all went\").", 
            "To maintain the integrity of questions posted to the subreddit, throwaway accounts must start with `ThrowRA`. Throwaway accounts not starting with this string may find their posts more likely to be removed.", 
            "Requests for advice should focus on what to do after something's already happened. If you're asking whether you should've handled something differently, your request is one for moral judgment rather than a request for advice on what to do next."
        ]
    }, 
    "instant_regret": {
        "popularity": 1998190, 
        "rules": [
            "No text messages or still frames. Sometimes the display of regret is unmistakable. It can be evident in someone's face, or in their body language. Sometimes it's a judgment call. If you think it works, try it out. If we delete it, you were wrong. We are Reddit™ moderators. We are always right!", 
            "If someone does something which only has bad consequences minutes or hours later, it is not considered instant.  \nThe regret was shown much later than the regretful action was performed", 
            "We love animals. They are capable of regret, but we don't want to see videos where their regret is the fault of humans, involves cruelty, injury or is in any way unpleasant.", 
            "Just pick one good thing and go with it. Everybody likes it when you do that.", 
            "Video link doesn't direct immediately to scene with regret and there is no timestamp in the title.", 
            "Reposts are highly discouraged. Reposts are allowed, but reposts which have been posted recently or are in the top of all time will be removed.", 
            "Racist, sexist, derogatory, or otherwise hateful content", 
            "User only posts videos from youtube accounts that reupload popular videos", 
            "GallowBoob BallowGoob", 
            "Be nice to turtles pls"
        ]
    }, 
    "photography": {
        "popularity": 1964535, 
        "rules": [
            "Posting images is only allowed as self-post using the photo as an example for the discussion, either to begin a general conversation about aspects of the example or to ask a photography-related question. The image should be used in support of an overall topic/question rather than the focus of the post. If you want to share an image you've taken, post in /r/photographs. You can also post in /r/pics, /r/itookapicture, or for critique, /r/photocritique. For film photos, check out /r/analog.", 
            "Questions asking for help (including equipment purchasing advice) should be posted as comments in the most recent Official Question thread, stickied at the top of the subreddit. Before posting, please check our extensive FAQ, your question may already have been answered! When seeking purchase recommendations, please be specific about how much you can spend.", 
            "We do not allow blogspam, ads, shortlinks, self-promotion (including seeking votes for your contest entry, and referral links), crowdsourced funding circlejerking, karmawhoring, surveys and/or market research, or DAE/ITAP posts.", 
            "We do not allow personal attacks. Violations may result in a ban.", 
            "If you want to sell a photography item to redditors or want to buy a photography item from a redditor, please use /r/photomarket.", 
            "Use the flair system only for your portfolio and nothing else! Not allowed for example: Gear, blogspam, shortlinks.", 
            "Please direct any discussions about the sub itself to r/metaphotography."
        ]
    }, 
    "Games": {
        "popularity": 1944087, 
        "rules": [
            "Submissions and comments that are intended to entertain rather than inform or discuss will be removed.\n\n[Click for our full rules and descriptions](https://www.reddit.com/r/Games/wiki/rules).", 
            "Whether against a reddit user or people in the industry, inciting harassment on any individual or group is not acceptable under any circumstances and will likely result in a ban.\n\n[Click for our full rules and descriptions](https://www.reddit.com/r/Games/wiki/rules).", 
            "Submissions should be directly related to games or the game industry. Top level comments must be on topic. Lower level comments should be reasonably related to the discussion. \n\n[Click for our full rules and descriptions](https://www.reddit.com/r/Games/wiki/rules).", 
            "Reposts or submissions with extremely similar content to an existing submission may be removed at mod discretion.\n\n[Click for our full rules and descriptions](https://www.reddit.com/r/Games/wiki/rules).", 
            "Digital piracy is the unauthorized use or reproduction of another's work, games or other. Enabling piracy by informing others how to circumvent the law or linking to it by providing access to pirated material is not allowed. This includes linking to scanned images of other copyrighted work, such as commercial magazines. News and discussion regarding emulators is allowed provided no copyrighted content is linked to.\n\n[Click for our full rules and descriptions](/r/Games/wiki/rules).", 
            "/r/Games has specific formatting requirements for submissions. This covers titles, sources, and post content.\n\n[Click for full rules on formatting requirements](https://www.reddit.com/r/Games/wiki/rules#wiki_formatting_requirements)", 
            "/r/Games has rules that restrict specific types of content. For example, discussion submissions should aim to have broad enough scope for quality discussion, whereas looking for a solution or game suggestion, unsubstantiated rumours, petitions/surveys, or posting about a server/community are not allowed.\n\n[Click for full rules on content restrictions](/r/Games/wiki/rules#wiki_specific_content_restrictions)", 
            "No more than 10% of your reddit account's submissions may be about a given topic or source, such as about one particular game, content from one particular website, or articles from one particular author. \n\n[Click for a full explanation of this rule](https://www.reddit.com/r/Games/wiki/rules#wiki_promotion_must_be_kept_within_acceptable_limits)"
        ]
    }, 
    "dadjokes": {
        "popularity": 1943446, 
        "rules": [
            "Jokes are just better that way.", 
            "Any personal information(i.e. phone numbers, email addresses, social media screenshots) that can identify the subject of the post or a comment, MUST be edited out."
        ]
    }, 
    "Minecraft": {
        "popularity": 1940024, 
        "rules": [
            "Use of derogatory language, purposefully inciting arguments, personal attacks and threats will not be tolerated. This includes the posting of personal information, posting with the intention of starting or propagating drama, soliciting griefing/hacking or intending to grief/hack, or the use of homophobic, sexist, racist or otherwise derogatory language. More information regarding our rules against homophobia can be found [here](/r/minecraft/w/homophobia).", 
            "Server advertising is *anything that promotes a server address, links to one, or recruits on behalf of one*, whether it be on /r/Minecraft itself or somewhere you linked to. This includes server subreddits. Don't ask for or answer requests for server details on /r/Minecraft.", 
            "Memes are not allowed. Images of text are not allowed. More detailed description available on [our wiki](/r/Minecraft/w/rules).", 
            "Don't advocate piracy or provide information on how to pirate. Cheat clients, websites or programs intended to assist piracy or griefing are not permitted.\n\nMisuse of the [Minecraft name, brand or assets](http://minecraft.net/brand) is disallowed. This includes distributing or selling unlicensed materials incorporating the Minecraft name, brand or assets; or anything *not sufficiently differentiated* therefrom.\n\nMore detailed description available on [our wiki](/r/Minecraft/w/rules).", 
            "Submissions that are related to Minecraft only through the title will be removed. This includes real life depictions of things that also happen to be in the game.", 
            "Submissions that belong as comments on an earlier post will be deemed chain posts and are eligible for removal. This especially applies to [fixed] posts and posts made in reference to other posts.", 
            "*A suggestion is anything that proposes a change to Minecraft.* Suggestions must be *explanatory* self.posts including what the suggestion adds and why it would be a good change. Images and videos may be used to visualize things, but shouldn't contain text or outweigh the written part of the suggestion. An alternative place to post suggestions is /r/MinecraftSuggestions.", 
            "This website, this subreddit and the moderators are largely English-speaking, other languages will not be understandable to many.", 
            "Anything sexually explicit, obscene or offensive will be subject to removal. Anything ‘not safe for work’ (NSFW) *must be marked as such.*", 
            "While we do allow links to archived videos on Twitch.tv, submissions linking to streams and channel pages are not allowed. These streams often do not last very long and could infringe on our subreddit rules, which could not realistically be enforced.", 
            "To submit a video, you must have gained some karma and have previous non-video contributions to /r/Minecraft. Videos uploaded via Reddit are not subject to this rule.", 
            "Submissions featuring often posted, old and uninteresting content are liable to be removed. Please see [this link](https://www.reddit.com/r/Minecraft/wiki/rules#wiki_commonly_posted_and_tired_submissions) for a list of tired submissions."
        ]
    }, 
    "loseit": {
        "popularity": 1903570, 
        "rules": [
            "We rely on user reports; If you see something on the sub that violates the rules please use the report button. If you are not sure if something breaks the rules report it for the moderation team to review.", 
            "Be good to one another. If critiquing do so constructively. Be polite and practice Reddiquette.", 
            "Use the report option; do not engage. Feeding trolls attracts more.", 
            "Regardless of gender, If we can see your midsection it is NSFW. Shirtless photos, underwear, swimsuit pictures, etc should all be labeled NSFW. Genitalia or outlines of genitalia through clothes will also be marked NSFW. Graphic content will also fall under this rule such as a severe injury.", 
            "Harassment comes in various forms. Don't be a creep to OP. Being a creep consists of suggesting OP post in a gonewild sub, saying what you'd like to do to OP, or generally venturing away from compliments and into pervy territory. Before complimenting OP make sure it's actually a compliment of their progress and not treating the person behind the screen like a sexual object. If you are harassed message the mods with a screenshot then escalate to the admins.", 
            "Stay on topic to the original post, the pictures, or the original poster's comments. Keep political debate to other subreddits regardless of your intention. Do not derail conversation.", 
            "Do not ask for users to participate in a cash-based diet website, such as dietbet.com. Do not ask for donations or link to a crowdfunding site such as GoFundMe.", 
            "Do not link to your own content for the purposes of generating views or traffic, as determined by the moderators based on the Reddit Self-Promotion Guidelines (https://www.reddit.com/wiki/selfpromotion)\nPosts, comments, and private messages promoting a product, service, or business are also prohibited. Links to discord servers posted outside of the Track with me Thursday thread will be met with a ban.", 
            "Surveys are prohibited.", 
            "Solo posts about a victory, milestone, or progress must include details to help others achieve the same success. This is not a reflection of how \"good\" or \"major\" your achievement is, it is a reflection of the quality of the post.", 
            "What may work for one individual may be completely unsustainable for another, especially if that body is experiencing changes such as puberty or pregnancy. We are not a Pro-ED community. Any diet or routine that falls consistently below the medically recommended minimums must be supervised by a healthcare professional and may not be recommended here."
        ]
    }, 
    "iphone": {
        "popularity": 1899638, 
        "rules": [
            "Image posts with camera photography will be removed. Try /r/iPhonePictures, /r/iphoneography, or /r/itookapicture.", 
            "No posts about throttling issues, speedtest results, battery life or Siri answers. Try /r/Siri instead.", 
            "No Amazon affiliate links (unless it's the official Reddit one).\nYou shouldn't be gaining anything from links posted. Don't post links to your own YouTube videos or blog posts.", 
            "No sites that provide only a brief summary with a link to the full article on someone else's site.", 
            "Do not submit photos of codes, or just the codes (from places like Starbucks) themselves.", 
            "No posting of app release notes (funny or otherwise) except for updates to iOS.", 
            "Posts must be about the iPhone in general. For all discussions about iOS or iOS beta specifically, please move the discussion to r/iOS or r/iOSBeta. We don't allow spam or irrelevant self-promotion without authorization from the moderators.", 
            "No support issues, tech questions or iPhone help requests, except in the Daily Tech Support Thread.", 
            "All posts must foster reasonable discussion, posts shouldn't just be \"Wow x feature is so cool\" or \"I hate x feature\"\nPosts should have actual content, and shouldn't be rants or \"circlejerking\" posts. This rule also covers spam and illegitimate/sketchy links.", 
            "No reposting and/or rehosted content. For reposts, please check the /new section of the sub to see if the content you want to post has been posted by another user. Rehosting usually means taking the content from the original source and hosting it somewhere. In /r/iphone's case, we mean that an article has shared the news that another source originally published.", 
            "No low-effort posts such as image macros and single sentence text posts. Moderators may use discretion to upkeep the quality of the subreddit.", 
            "No posts or comments relating to buying, selling, trading, giveaways or asking for advice about any of those topics, except in the WSIB thread."
        ]
    }, 
    "mildlyinfuriating": {
        "popularity": 1873016, 
        "rules": [
            "We don't like memes because they're low quality. See [this post](https://www.reddit.com/r/mildlyinfuriating/comments/1exsuk/meta_modpost_new_rule_see_inside_for_details/). This includes \"trendy\" title names such as \"This shit.\" and this rule is automatically enforced by automoderator.", 
            "- **a) Please try to post original content. Reposts or crossposts of someone else's content will be removed if it has been posted on Reddit within the past 6 months.**\n\nWe want fresh new content, and hopefully you do, too!", 
            "- **b) No GIFs that end slightly before something happens [Example](http://i.imgur.com/Lq6m5QY.gifv).**\n- **c) Unnecessarily overdone text, arrows, scribbles, or substantive edits over the original content are not allowed.**\n- **d) No surveys.**\n\nWe feel that this subreddit shouldn't act as a platform for survey spam and information harvesting, whether the surveys are academic in nature or not. Try /r/samplesize instead for a subreddit dedicated to surveys!", 
            "Its a site-wide rule of Reddit (rule 7) that you agreed to when you signed up. Don't post your own or others' personal information under any circumstances, as we can't verify of you are indeed posting your info. \n\nPersonal info can include: Full names, phone numbers, license plates, addresses, ID numbers, etc.\n\nIf you are unsure, [see the wiki](https://www.reddit.com/r/mildlyinfuriating/wiki/rules) for help on this.", 
            "Reddiquette is a set of guidelines designed by the community to foster positive behaviour, which is what we as moderators want for this subreddit. There's no need for us to reiterate Reddiquette ourselves; you can read about it [here](https://www.reddit.com/wiki/reddiquette).\n\nThe rules of Reddit are site-wide rules created by the admins, which must be followed at all times. Not following the rules may result in not only a ban from our subreddit, but from Reddit as well.", 
            "Material that could reasonably be deemed inappropriate, whether politically, sexually, racially, or socially, is prohibited. This includes, but is not limited to, discussion of illegal activities such as piracy, porn, and sexualisation of minors. Posts that push an agenda of any sort is also prohibited, including inappropriate posts about this subreddit or other subreddits as described below. If you're unsure if your post or comment falls under these categories, message the mods and ask!", 
            "We want to maintain friendly relationships with all other reddit communities and the first step to this is keeping a clean slate and not foul-mouthing other communities. Mentioning other subreddits is fine; talking about them in a negative way is not. When linking to other subs, it's required to add 'np' before 'reddit', e.g. np.reddit.com/r/mildlyinfuriating. This also applies to redd.it links. This is to prevent vote brigades into other communities and is strictly enforced by automoderator.", 
            "be nice to turtles pls."
        ]
    }, 
    "itookapicture": {
        "popularity": 1870450, 
        "rules": [
            "No paintings, illustrations or heavily altered images.", 
            "*2a.* You must be the author of the photos posted.\n\n*2b.* If you have concerns of plagiarism, please [contact the mod team directly.](https://www.reddit.com/message/compose?to=%2Fr%2Fitookapicture&subject=Suspected%20plagiarism&message=Include%20a%20link%20to%20the%20submission%20in%20the%20message!)", 
            "*3a.* Albums and other images can be posted in comments.\n\n*3b.* Panoramas, stacked images, panographs and double exposures are allowed.", 
            "*4a.* **Submitters must participate in the discussion.** Whether it's a photographer asking the community at large what s/he could have done better, or users asking how to achieve a look or effect, posters are expected to contribute to the comments section.\n\n*4b.* **No snapshots.** Your photo should be well-composed, have an obvious subject, feature good use of color/tone and/or texture, have interesting lighting, and make purposeful use of depth of field.", 
            "*5a.* All submission titles **must start with \"ITAP\"** and only describe the contents of the image. Keep titles short and descriptive of the photo contents. \n\n*5b.* Do not include your intention, reaction, interpretation, backstory, click-bait, memes, or emoji. Any such additional information should be added in a comment if you'd like to provide it.", 
            "6a. Photos with a primary focus on one person staring, looking or thinking, without any other interesting action **are limited to Mondays (Midnight - Midnight, GMT).**\n\n6b. Photos of people in a state of action, reaction or interaction, or share their focus with an interesting setting or background, employ some unique photography technique or have exceptional / atypical styling (hair, makeup, studio setups) are not subjected to this rule and are allowed throughout the week.", 
            "Mona Lisa Monday submission titles **must include the [MLM] tag.**", 
            "A photo may be submitted to /r/itookapicture only once.", 
            "*8a.* Constructive criticism is what this subreddit is here for. Structure your feedback on what you like about the photo, what you don’t like, how you would improve it. “Great Photo” may be a nice compliment, but it does nothing to help the submitter or other readers.\n\n*8b.* Don’t take offense to negative feedback. Understanding your mistakes and shortcomings is the best way to overcome them in future work.", 
            "*9a.* Off-topic comments unrelated to the photo will be removed.\n\n*9b.* Abusive language will result in a ban. This includes insults, swearing and sexual comments."
        ]
    }, 
    "Android": {
        "popularity": 1863899, 
        "rules": [
            "All posts to /r/Android must be related to the Android OS in some *direct way.* Posts not related to Android or the Android ecosystem will be removed.", 
            "We welcome posts that benefit the community (device reviews, guides, discussions and rumors) and not the individual (rants, general/tech inquiries, customer service complaints, or selling/trading devices).  \n\nYour post must promote high-quality discussion content and not hit and run \"What do you think about X?\" posts.", 
            "Please provide an explanation in the self-post body.\nNo memes, reaction GIFs, or screenshots that don't benefit the community (e.g. screenshots of your phone's battery life).", 
            "Developers may post their own apps, however, they must meet these three conditions:\n\nTheir post must be a self post with a detailed description of their app.\nThe developer's account must be at least three months old AND have a reasonable posting history on reddit.\nThe developer must be able to interact with users in the thread.\nWe do not allow developers to simply dump a link to their app and leave.", 
            "There are many tech sites out there, and when some major news piece breaks they'll all rush to cover it. reddit is a content aggregation site, but that doesn't mean every single blog that posts about something has to be submitted here. If what you're submitting has already been covered by another article posted on /r/Android, your post may be removed. We don't need to see the same content posted 20 times.", 
            "When submitting an article, your post title must either match the article's title, directly quote from the article, or accurately summarize the article. Do not alter the post title in such a way that your personal opinion is shown in the title. Do not pose a question to the readers of /r/Android that the article itself does not do. Your title must show neutrality and avoid any bias on your part (the same is not true of the article you may be submitting, however.)", 
            "Regarding piracy: /r/Android has a strong developer presence, and we want to keep it that way. We do not condone app piracy and will ban any user posting links to APKs not authorized by the developer. Do not discuss or link to app piracy markets or websites posting pirated apps.", 
            "To prevent scams, we require that all polls or giveaways be approved by the moderators. Message the moderator mail with your request before you post any poll or do any giveaway. \n\nOnly pre-approved bots are allowed on /r/Android. Currently, the only bot we allow is the Play Store Link bot. This bot can be summoned by commenting \"Linkme: APPNAMEHERE.\" without quotes. If you wish to use your bot on this sub, then message the mods and show us that it can serve a useful purpose here.", 
            "Do not be rude to any other user. Be respectful, or you may be banned.\n\nDo not use hate speech of any kind.\n\nDo not be disrespectful towards another for their personal choices (excessive fanboyism).\n\nDo not accuse others of being \"paid shills.\"\n\nDo not post low-effort/circlejerky comments.", 
            "If you are a Redditor, affiliate links are absolutely NOT allowed in either the comments section, within the self-text of your post, or as part of your link.\n\nIf you post an article, affiliate links will NOT be allowed if the article being linked is a simple \"deal alert\" type post. Instead, simply link directly to the deal (without the affiliate link included)."
        ]
    }, 
    "Damnthatsinteresting": {
        "popularity": 1862145, 
        "rules": [
            "If you title your post anything like \"You won't believe ____!\" or \"27 things to do before you die!\" it will be removed.", 
            "Racism and hate speech will be removed and the poster will be banned.", 
            "Imgur links must be directly to the image or the album", 
            "Infographics are graphic visual representations of information, data or knowledge intended to present information quickly and clearly.", 
            "Posts are at the discretion of the moderators. If we do not believe it to be interesting, or think it is spam, we will remove it.", 
            "A post made on r/damnthatsinteresting within the last 90 days is considered a repost", 
            "No use of Photoshop, the posts need to be interesting IRL.", 
            "Users are only allowed to post 1 image w/ text per day. This will be determined in UTC time.", 
            "Image w/ text posts must have a linked and credible source to backs up the information."
        ]
    }, 
    "pokemon": {
        "popularity": 1831458, 
        "rules": [
            "Posts should be flaired correctly on /r/pokemon. Available flairs are Art, Craft, Meme, Image, Discussion, Media, and Info!", 
            "A full description of this rule is available at /r/pokemon/wiki/rules.", 
            "A full description of this rule is available at /r/pokemon/wiki/rules.", 
            "Images/Media posted within the last 6 months.  \nTexts posts on a topic posted within the last 2 weeks.  \nA full description of this rule is available at https://www.reddit.com/r/pokemon/wiki/rules#wiki_3a_reposts.", 
            "A full description of this rule is available at https://www.reddit.com/r/pokemon/wiki/rules#wiki_3b_text_posts", 
            "Screenshots, Merchandise pics, Let's Play/Unboxing videos, etc.  \nA full description of this rule is available at /r/pokemon/wiki/rules.", 
            "Includes self deprecating post titles on creative work posts.  \nA full description of this rule is available at https://www.reddit.com/r/pokemon/wiki/rules#wiki_3e_post_titles", 
            "A full description of this rule is available at /r/pokemon/wiki/rules.", 
            "A full description of this rule is available at https://www.reddit.com/r/pokemon/wiki/rules#wiki_rule_5.3A_illegal_and_inappropriate_content", 
            "A full description of this rule is available at https://www.reddit.com/r/pokemon/wiki/rules#wiki_6a_original_work_only"
        ]
    }, 
    "hiphopheads": {
        "popularity": 1814720, 
        "rules": [
            "Unwelcome content and prohibited behavior [as defined by Reddit](https://www.reddit.com/help/contentpolicy/) is never allowed. Additionally, comments deemed overtly racist, sexist, homophobic, transphobic, etc. will be removed and may result in a permanent ban at the moderator's discretion. Users who are found to regularly start/engage in flame wars or harass other users may be banned at moderator discretion.", 
            "Do not post questions or requests outside of the Daily Discussion, Moronic Monday, Music Recommendations or Sunday General Discussion threads. The only exceptions are for appropriate [DISCUSSION] threads (e.g. \"Where is the line between biting and paying homage drawn?\") If you are seeking the answer to a question about the name of a song, the source of a sample, the status of a project, the meaning of a line/song, the appeal of an artist, etc., ask in one of the recurring threads."]}}